[
    {
        "ID": 0,
        "joke": "[me narrating a documentary about narrators] \"I can't hear what they're saying cuz I'm talking\"",
        "translation": "我在讲述一部关于讲述者的纪录片时说：“我听不到他们在说什么，因为我正在说话。”<|im_end|>"
    },
    {
        "ID": 1,
        "joke": "Telling my daughter garlic is good for you. Good immune system and keeps pests away.Ticks, mosquitos, vampires... men.",
        "translation": "告诉女儿大蒜对你有好处。增强免疫系统，还能驱赶害虫。蜱虫、蚊子、吸血鬼……男人。<|im_end|>"
    },
    {
        "ID": 2,
        "joke": "I've been going through a really rough period at work this week It's my own fault for swapping my tampax for sand paper.",
        "translation": "这周我在工作上经历了一段 really rough 时期。这都是我自己惹的祸，因为我把卫生棉换成了砂纸。<|im_end|>"
    },
    {
        "ID": 3,
        "joke": "If I could have dinner with anyone, dead or alive... ...I would choose alive. -B.J. Novak-",
        "translation": "如果我能和任何人共进晚餐，无论是生者还是死者，我都会选择和生者共餐。——B.J.诺瓦克<|im_end|>"
    },
    {
        "ID": 4,
        "joke": "Did you hear about the guy who blew his entire lottery winnings on a limousine? He had nothing left to chauffeur it.",
        "translation": "你听说那个把所有彩票 winnings 都花在了一辆豪华轿车上的家伙了吗？他连车夫都请不起。<|im_end|>"
    },
    {
        "ID": 5,
        "joke": "What do you do if a bird shits on your car? Don't ask her out again.",
        "translation": "如果鸟粪落在你的车上，你应该怎么做？不要再约她了。<|im_end|>"
    },
    {
        "ID": 6,
        "joke": "Telling my daugthers date that \"she has lice and its very contagious the closer you get to her.\" *Correct way to parent.",
        "translation": "告诉女儿的约会对象：“她有虱子，而且离她越近就越容易传染。” *正确的育儿方式。<|im_end|>"
    },
    {
        "ID": 7,
        "joke": "What's the difference between an illegal Mexican and an autonomous robot...? Nothing... they were both made to steal American jobs.",
        "translation": "非法墨西哥人和自主机器人之间的区别是什么……没什么区别……它们都是用来偷美国工作的。<|im_end|>"
    },
    {
        "ID": 8,
        "joke": "You ever notice that the most dangerous thing about marijuana is getting caught with it?",
        "translation": "你有没有注意到，大麻最危险的事情就是被抓住使用它？<|im_end|>"
    },
    {
        "ID": 9,
        "joke": "My wife is in a bad mood. I think her boyfriend forgot their anniversary. Way to go, dude. Now we all suffer...",
        "translation": "我的妻子心情不好。我想她的男朋友可能忘了他们的纪念日。真是的，现在我们大家都受苦了……<|im_end|>"
    },
    {
        "ID": 10,
        "joke": "My speech today will be like a mini-skirt. Long enough to cover the essentials but short enough to hold your attention!",
        "translation": "今天我要发表的演讲就像迷你裙一样。长到足以覆盖所有要点，短到足以吸引你的注意力！<|im_end|>"
    },
    {
        "ID": 11,
        "joke": "Thanksgiving joke What does Miley Cyrus eat for Thanksgiving? Twerky! Just kidding... Drugs. She eats drugs. -Adam Zopf @adamzopf",
        "translation": "感恩节笑话 米莉· Cyrus 在感恩节吃什么？是“扭臀”！开个玩笑……其实是毒品。她吃毒品。- Adam Zopf @adamzopf<|im_end|>"
    },
    {
        "ID": 12,
        "joke": "Why do you never see elephants hiding in trees? 'Cause they are freaking good at it",
        "translation": "为什么你从不会看到大象躲在树上？因为他们真的很擅长这样做。<|im_end|>"
    },
    {
        "ID": 13,
        "joke": "\"That guy is such a douche-bag! Is he single? Maybe I can fix him!\"  women",
        "translation": "那个家伙真是个混蛋！他单身吗？ maybe 我可以帮他一把！<|im_end|>"
    },
    {
        "ID": 14,
        "joke": "My son just got a tattoo of a heart, a spade, a club, and a diamond, all without my permission. I guess I'll deal with him later.",
        "translation": "我的儿子未经我允许纹了一个心形、黑桃、方块和红心的纹身，看来我以后得和他谈谈了。<|im_end|>"
    },
    {
        "ID": 15,
        "joke": "What's the difference between a painting and Jesus. You only require one nail to put up the painting.",
        "translation": "画和耶稣的区别是什么？只需要一个钉子就能挂上画。<|im_end|>"
    },
    {
        "ID": 16,
        "joke": "Mom: \"Do you want this?\" Me: \"No.\" Mom: \"Ok I'll give it to your brother.\" Me: \"No I want it.\"",
        "translation": "妈妈：“你要这个吗？”我说：“不要。”妈妈：“那我给你的哥哥吧。”我说：“不要，我要这个。”<|im_end|>"
    },
    {
        "ID": 17,
        "joke": "I am looking forward to 6pm Thanksgiving Day when Walmart opens its doors for its annual sale of trampled human corpses.",
        "translation": "我期待着感恩节下午6点，沃尔玛开门进行其一年一度的人体残骸大甩卖。<|im_end|>"
    },
    {
        "ID": 18,
        "joke": "Yttrium-barium-copper oxide walks into a bar The bartender tells him, \"We don't serve superconductors here.\" He leaves without resistance.",
        "translation": "钇钡铜氧化合物走进了一家酒吧。酒保对他说：“我们这里不提供超导体。”他毫不费力地离开了。<|im_end|>"
    },
    {
        "ID": 19,
        "joke": "Every night, I take all of the singles out of my wallet, spread them on the bed, and pretend I was pretty that day.",
        "translation": "每晚，我把钱包里的所有单张钞票拿出来，摊在床上，假装自己那天过得很好。<|im_end|>"
    },
    {
        "ID": 20,
        "joke": "Before I destroy a wasp's nest I like to capture a single wasp and tell it my entire diabolical plan.",
        "translation": "在我摧毁蜂巢之前，我喜欢先捕捉一只蜜蜂，然后告诉它我全部的邪恶计划。<|im_end|>"
    },
    {
        "ID": 21,
        "joke": "INTERVIEWER: Why do you want to work here? ME: *crumbs tumbling from my mouth* Oh, I don't. I was just walking by and saw you had donuts.",
        "translation": "面试官：你为什么想在这里工作？我：*嘴里掉出面包屑* 哦，我不想。我只是路过，看到你们这里有甜甜圈。<|im_end|>"
    },
    {
        "ID": 22,
        "joke": "Coming on valentines day. Fifty shades of grey. There won't be a dry seat in the cinema.",
        "translation": "情人节上映。五十度灰。电影院里不会有干爽的座位。<|im_end|>"
    },
    {
        "ID": 23,
        "joke": "Did you hear about the midget psychic who escaped from prison? He's a small medium at large.",
        "translation": "你听说过那个矮小的灵媒越狱了吗？他是个小灵媒，逍遥法外。<|im_end|>"
    },
    {
        "ID": 24,
        "joke": "Someone didnt click the button in /r/thebutton Yeah... Thats a good joke , he impossible!",
        "translation": "有人在/r/thebutton 没有点击按钮…… 哈哈，这真是个好笑的梗，他不可能做到！<|im_end|>"
    },
    {
        "ID": 25,
        "joke": "What's the difference between a car tyre, and 365 condoms? One's a Goodyear, an the other's a great year.",
        "translation": "轮胎和365个避孕套有什么区别？一个是固特异，另一个是一整年的好时光。<|im_end|>"
    },
    {
        "ID": 26,
        "joke": "I've struggled for years to be above the influence... But I've never been able to get that high",
        "translation": "我花了多年时间试图远离那种影响……但我从未能达到那种高度<|im_end|>"
    },
    {
        "ID": 27,
        "joke": "With Facebook, you can stay in touch with people you would otherwise never talk to, but that's only one of the many awful things about it",
        "translation": "使用Facebook，你可以与那些你本来永远不会交谈的人保持联系，但这只是它众多糟糕之处之一。<|im_end|>"
    },
    {
        "ID": 28,
        "joke": "What's the difference between a blonde and a washer? When you dump your load in a washer, it doesn't follow you around for a week.",
        "translation": "黄头发和洗衣机有什么区别？当你把衣服放进洗衣机里，它不会跟着你一整周。<|im_end|>"
    },
    {
        "ID": 29,
        "joke": "Have you ever heard of the movie \"Constipation\"? No? Most likely because it never came out.",
        "translation": "你听说过电影《便秘》吗？没有吧？很可能是因为这部电影从未上映过。<|im_end|>"
    },
    {
        "ID": 30,
        "joke": "I saw a French rifle on eBay today It's never been fired but I heard it was dropped once.",
        "translation": "我在eBay上看到了一把法国步枪。它从未被发射过，但我听说它曾经被掉过一次。<|im_end|>"
    },
    {
        "ID": 31,
        "joke": "Bill Clinton must be the luckiest man in the world. All of the sex he has, with Hillary, you know it's hate sex.",
        "translation": "比尔·克林顿一定是世界上最幸运的男人。他和希拉里的所有性行为，你们知道那是恨意之吻。<|im_end|>"
    },
    {
        "ID": 32,
        "joke": "yeah girl.. shake that thing where poop comes out of. it really turns me on when your poop factory shakes faster than usual",
        "translation": "嘿，姑娘……摇动那个东西，从里面排出排泄物。当你的排泄工厂比平时摇得更快时，真的能让我非常兴奋。<|im_end|>"
    },
    {
        "ID": 33,
        "joke": "\"I can't stand when people say they hate both of the presidential candidates.\" --Stephen Hawking",
        "translation": "“我无法忍受人们说他们讨厌两位总统候选人。”——斯蒂芬·霍金<|im_end|>"
    },
    {
        "ID": 34,
        "joke": "I was drinking at the bar, so I took a bus home. That may not be a big deal to you, but I've never driven a bus before!",
        "translation": "我在酒吧喝酒，所以坐公交车回家了。这对你可能不算什么，但我以前从来没有开过公交车！<|im_end|>"
    },
    {
        "ID": 35,
        "joke": "Donald Trump will ban the sale of shredded cheese He wants to make America grate again",
        "translation": "唐纳德·特朗普将禁止销售碎奶酪，他想让美国再次变得粗糙。<|im_end|>"
    },
    {
        "ID": 36,
        "joke": "Things have really turned around for me since I re-named my penis and testicles \"JD Power and Associates\".",
        "translation": "自从我把阴茎和睾丸改名为“JD Power and Associates”以来，我的生活发生了很大的转变。<|im_end|>"
    },
    {
        "ID": 37,
        "joke": "My cat just walked by me carrying a toy mouse I don't remember buying her. Women be shoppin!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "translation": "我的猫刚刚拿着一只玩具老鼠从我身边走过，这只老鼠是我记不得给她买的。女人就是爱购物!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "ID": 38,
        "joke": "Sometimes you check the amount of subscribed people. When you do this, there are 4,111,093,0003.666 \"humorists\". 2/3rds of a person? Really?",
        "translation": "有时候你会检查订阅人数。当你这样做时，有4,111,093,0003.666个“幽默家”。三分之二的人？真的吗？<|im_end|>"
    },
    {
        "ID": 39,
        "joke": "I don't believe in Bigfoot; because he never believed in me. I'd scan the crowd at my ballet recitals, and always see that one empty seat.",
        "translation": "我不相信大脚怪，因为大脚怪从不相信我。每次在芭蕾舞演出时，我都会扫视观众席，总能看到一个空座位。<|im_end|>"
    },
    {
        "ID": 40,
        "joke": "What did the porn actress say when she opened the door? Make sure to come upstairs.",
        "translation": "色情演员在开门时说了什么？请上楼来。<|im_end|>"
    },
    {
        "ID": 41,
        "joke": "I don't judge people based on color, race, religion, sexuality, or gender...I base it on whether or not they're an asshole.",
        "translation": "我不根据肤色、种族、宗教、性取向或性别来评判人，我只会根据他们是否是混蛋来评判。<|im_end|>"
    },
    {
        "ID": 42,
        "joke": "Not to get too technical, but chemistry says alcohol IS a solution. So I win.",
        "translation": "不走技术路线，但化学上说酒精确实是一种溶液，所以我赢了。<|im_end|>"
    },
    {
        "ID": 43,
        "joke": "I often think if I'd taken a different path in life, I could be lying on a slightly more comfortable sofa right now.",
        "translation": "我常常想，如果当初在人生道路上选择了不同的路径，我现在可能正躺在一张稍微更舒适的沙发上。<|im_end|>"
    },
    {
        "ID": 44,
        "joke": "What did the hillbilly say to his sister after she asked him to have sex with her? If you incest.",
        "translation": "hillbilly对他的姐姐说：“如果你是incest，那我就不和你上床了。”<|im_end|>"
    },
    {
        "ID": 45,
        "joke": "\"You know what, we need a huge spoon to take care of this\" -Guy who invented shovels",
        "translation": "你知道吗，我们需要一个巨大的勺子来处理这个问题——发明铲子的人<|im_end|>"
    },
    {
        "ID": 46,
        "joke": "How to keep the flies off the bride at an Italian wedding Keep a bucket of shit next to her",
        "translation": "如何在意大利婚礼上让苍蝇远离新娘？就在她旁边放一桶shit。<|im_end|>"
    },
    {
        "ID": 47,
        "joke": "7% of all hearing loss is a result of sitting in a restaurant next to a table full of women who just received dessert.",
        "translation": "所有听力损失中有7%是由于坐在餐厅旁边，紧挨着刚吃完甜点的女性餐桌旁造成的。<|im_end|>"
    },
    {
        "ID": 48,
        "joke": "What do people from the 1930's and /r/news jokes have in common? They're both old.",
        "translation": "1930年代的人和/r/news的笑话有什么共同点？他们都很老。<|im_end|>"
    },
    {
        "ID": 49,
        "joke": "ME: I fell off a 50 ft tall ladder once GIRL: holy cow how did you survive ME: I fell off the bottom rung",
        "translation": "我曾经从一把50英尺高的梯子上摔下来。女孩：天哪，你是怎么活下来的？我说：我从最下面的横档摔下来的。<|im_end|>"
    },
    {
        "ID": 50,
        "joke": "What do you call a blind dinosaur? A do-think-he-saurus :) !! Lol What do you call a blind dinosaurs dog? A do-you-think-he-saurus-rex",
        "translation": "你叫什么名字，瞎了的恐龙？瞎想龙！哈哈哈。那你叫什么名字，瞎了的恐龙的狗？瞎想龙霸王！<|im_end|>"
    },
    {
        "ID": 51,
        "joke": "This may be not be a mainstream opinion, but I don't believe you should cut down a Christmas tree unless you intend on eating it.",
        "translation": "这可能不是主流观点，但我认为除非打算食用，否则不应该砍伐圣诞树。<|im_end|>"
    },
    {
        "ID": 52,
        "joke": "Jenna Jameson to Oprah, \"There's a little bit of Jenna Jameson in everyone.\" I'm pretty sure she got that backwards.",
        "translation": "珍娜·詹姆斯蒙对奥普拉说：“每个人身上都有一点珍娜·詹姆斯蒙。”我敢肯定她弄反了。<|im_end|>"
    },
    {
        "ID": 53,
        "joke": "I have a degree in men's studies. It's called \"world history\". #TRUMP 2016! YOU CAN'T STUMP THE TRUMP!",
        "translation": "我有一个关于男性研究的学位，叫做“世界历史”。#TRUMP 2016！你休想难倒特朗普！<|im_end|>"
    },
    {
        "ID": 54,
        "joke": "Why don't most fans like the first 39 episodes of DBZ? Its pretty gay, just Saiyan.",
        "translation": "为什么大多数粉丝不喜欢《龙珠Z》的前39集？因为它太gay了，全是赛亚人。<|im_end|>"
    },
    {
        "ID": 55,
        "joke": "This doctor once told me eating a bagel was like eating 5 slices of bread and I was like ok, cool, I like bread",
        "translation": "这位医生曾经告诉我，吃一个贝果就像吃了5片面包，我当时心想，哦，好吧，挺酷的，我喜欢面包。<|im_end|>"
    },
    {
        "ID": 56,
        "joke": "What do you call a three-humped camel? Pregnant (Told to me by one of the kids at work)",
        "translation": "三峰驼叫什么？怀孕的（一个同事告诉我的）<|im_end|>"
    },
    {
        "ID": 57,
        "joke": "What defies the law of gravity? Women. They heavier they are, the easier they are to pick up.",
        "translation": "什么是违反重力定律的？是女人。她们越重，反而越容易提起。<|im_end|>"
    },
    {
        "ID": 58,
        "joke": "Everything has to be related in a woman: if the mouth shuts, the legs open.",
        "translation": "在女人身上，一切都得有关联：如果嘴闭上了，腿就张开了。<|im_end|>"
    },
    {
        "ID": 59,
        "joke": "\"I'm so pissed I could punch a ba-\" \"A what?\" Big Baby from Toy Story 3 hovers over me, sawed-off shotgun in hand. \"A bagel. I HATE carbs.\"",
        "translation": "我气得简直想揍一个“包-” “一个什么？”《玩具总动员3》中的大宝宝手持锯短的猎枪悬停在我上方。“一个甜甜圈。我讨厌碳水化合物。”<|im_end|>"
    },
    {
        "ID": 60,
        "joke": "What's the difference Donald Trump and my Vagina? One's a Cunt and the other has nice hair.",
        "translation": "唐纳德·特朗普和我的阴道有什么区别？一个是蠢货，另一个有漂亮的头发。<|im_end|>"
    },
    {
        "ID": 61,
        "joke": "My doctor had to put me on a new medication that's supposed to help lower the amount of karate in my blood",
        "translation": "我的医生让我服用了一种新药，据说可以帮助降低我血液中的空手道含量。<|im_end|>"
    },
    {
        "ID": 62,
        "joke": "[uses the restroom] Wife: make sure to put the toilet seat down Me: okay Me: [to toilet seat] you're worthless and nobody likes you",
        "translation": "[去洗手间] 妻子：记得把马桶盖放下。 我：好的。 我：[对马桶盖] 你毫无价值，没人喜欢你。<|im_end|>"
    },
    {
        "ID": 63,
        "joke": "Q: What's the difference between a blonde and a supermarket trolley? A: The supermarket trolley has a mind of its own.",
        "translation": "Q: 黄色头发和超市手推车有什么区别？A: 超市手推车有自己的思想。<|im_end|>"
    },
    {
        "ID": 64,
        "joke": "You know... When someone says to you \"Jesus loves you.\" It's always comforting. Unless you are in a Mexican jail.",
        "translation": "你知道吗……当有人对你说“耶稣爱你”时，这总是令人感到安慰。除非你正在墨西哥监狱里。<|im_end|>"
    },
    {
        "ID": 65,
        "joke": "When I hear \"This call is being monitored for quality assurance\" I think \"Cool, let's see how bad this person wants their job.\"",
        "translation": "当我听到“此通话正被监控以确保服务质量”时，我想：“酷，让我们看看这个人有多想保住自己的工作。”<|im_end|>"
    },
    {
        "ID": 66,
        "joke": "You know what the definition of \"competitive\" is? Finishing first *and* third in a circlejerk.",
        "translation": "你知道“有竞争力”的定义吗？就是在自嗨中同时获得第一和第三。<|im_end|>"
    },
    {
        "ID": 67,
        "joke": "How do you know if your wine was made in the 90's? It smells like teen spirit.",
        "translation": "你怎么知道你的葡萄酒是90年代生产的？闻起来就像《青少年精神》的味道。<|im_end|>"
    },
    {
        "ID": 68,
        "joke": "[car wreck] [hand reaches out] \"Take my hand. I'm Chad Kroeger from the popular band Nickelback.\" [I let the flames slowly bake me alive]",
        "translation": "[车祸现场] [一只手伸出来] “抓住我的手，我是流行乐队镍背的查德·克罗eger。” [我让火焰慢慢地将我烤熟]<|im_end|>"
    },
    {
        "ID": 69,
        "joke": "Just waiting for Steve Harvey to come out and say it's actually Clinton any second now",
        "translation": "一直在等着史蒂夫·哈维出来宣布其实是克林顿，随时都可能<|im_end|>"
    },
    {
        "ID": 70,
        "joke": "Chicken Why did the chicken cross the road? Why? To go to the gay guys house Knock knock Who's there? The chicken",
        "translation": "鸡 为什么过马路？为什么？去同性恋的家。 Knock knock 谁在那儿？鸡<|im_end|>"
    },
    {
        "ID": 71,
        "joke": "Teacher: Why do we put a hyphen in a bird-cage?  Pupil: For a parrot to perch on miss.",
        "translation": "老师：我们在鸟笼里为什么要加一个连字符？  学生：为了让鹦鹉有个地方休息。<|im_end|>"
    },
    {
        "ID": 72,
        "joke": "I visited Amsterdam this summer, and decided to have sex with a prostitute. It was an overall positive experience. Sadly, it was an HIV positive experience.",
        "translation": "今年夏天我去了一趟阿姆斯特丹，决定和一个妓女发生性关系。总体来说是一次积极的经历。可惜的是，这是一次艾滋病的经历。<|im_end|>"
    },
    {
        "ID": 73,
        "joke": "Yup. If pasta & antipasta ever touch, they annihilate. For your safety, that's why restaurants never serve them together.",
        "translation": "是的。如果意面和前菜相遇，它们会互相湮灭。为了您的安全，这就是餐馆从不将它们一起提供的原因。<|im_end|>"
    },
    {
        "ID": 74,
        "joke": "When my wife takes a nap, it's \"desperately needed rest.\" When I do, it's \"lazy chauvinist party-time.\"",
        "translation": "当妻子午睡时，那是“极度需要的休息”。而当我午睡时，那就是“懒惰的男权派对时间”。<|im_end|>"
    },
    {
        "ID": 75,
        "joke": "lookin for a quick and easy way to beef up that scrawny bod and really turn some heads at the beach? float dead in a lake",
        "translation": "想找一个快速简便的方法来增强那副瘦弱的身体，并在海滩上吸引眼球吗？那就去湖里淹死吧。<|im_end|>"
    },
    {
        "ID": 76,
        "joke": "TIL A ref can show a player the red card for a loud fart ... even if it isn't Messi.",
        "translation": "今天我知道：一名裁判可以因为球员放了个响亮的屁就出示红牌，即使这个人不是梅西。<|im_end|>"
    },
    {
        "ID": 77,
        "joke": "What did the wise man say to the fat guy? You should probably go on a diet.",
        "translation": "明智的人对那个胖人说了什么？你应该节食。<|im_end|>"
    },
    {
        "ID": 78,
        "joke": "Who is better? The 3rd wave feminist or the pencil? The pencil is better. It has a point.",
        "translation": "谁更好？第三波女权主义者还是铅笔？铅笔更好。它有一个尖端。<|im_end|>"
    },
    {
        "ID": 79,
        "joke": "Guys, I think I found the Cure to Aids! It requires having a Magic Johnson.",
        "translation": "伙计们，我觉得我找到了治疗艾滋病的方法！这需要有一位魔术师·约翰逊。<|im_end|>"
    },
    {
        "ID": 80,
        "joke": "Why do you call a Mexican midget a paragraph? ...because he's too short to be called an essay.",
        "translation": "为什么你叫一个墨西哥侏儒一段话？……因为他太矮了，不能被称为一篇论文。<|im_end|>"
    },
    {
        "ID": 81,
        "joke": "This morning I had a swollen testicle. \"I'd have simply preferred toast,\" I told my wife.",
        "translation": "今天早上我睾丸肿了。“我宁愿要烤面包片，”我对妻子说。<|im_end|>"
    },
    {
        "ID": 82,
        "joke": "\"What's that?\" A divorce jar. Every time we fight you put a dollar in and I'm a little bit closer to freedom. *puts in dollar* \"WTH!?!\"",
        "translation": "“那是什么？”是一个离婚罐。每次我们吵架，你就放一美元进去，我离自由就更近了一点。*放了一美元*“天哪！！”<|im_end|>"
    },
    {
        "ID": 83,
        "joke": "If you have a parrot and you don't teach it to say,\"Help, they've turned me into a parrot.\" you are wasting everybody's time.",
        "translation": "如果你有一只鹦鹉却不教它说，“救命，他们把我变成了一只鹦鹉。”那你就是在浪费大家的时间。<|im_end|>"
    },
    {
        "ID": 84,
        "joke": "My 8 y/o memorized my 12 character password that has upper and lowercase letters, numbers and symbols but can't remember to flush the toilet",
        "translation": "我的8岁孩子记住了我那个包含大小写字母、数字和符号的12字符密码，但却记不住冲厕所。<|im_end|>"
    },
    {
        "ID": 85,
        "joke": "Me: waiter, do you have frog legs? Waiter: of course monsieur Me: good, hop over there and get me a beer",
        "translation": "服务员：先生，你们有蛙腿吗？  服务员：当然了，先生。  我说：好的，你跳过来给我拿一杯啤酒。<|im_end|>"
    },
    {
        "ID": 86,
        "joke": "It's comforting to know that the US government works the same way as a college student when it comes to deadlines... They both wait until the last minute, then get an extension.",
        "translation": "知道美国政府在截止日期上运作的方式就像大学生一样令人安心……他们都等到最后一刻，然后申请延期。<|im_end|>"
    },
    {
        "ID": 87,
        "joke": "What did the man with The World's Largest Penis say when he had to have his legs amputated \"Don't worry, I still have my third one.\"",
        "translation": "这个男人在被截肢时，他对自己说：“别担心，我还有第三根呢。”<|im_end|>"
    },
    {
        "ID": 88,
        "joke": "What's the worse thing to do to a blind person? Leave a plunger in the toilet",
        "translation": "对盲人来说最糟糕的事情是什么？把一个塞子留在马桶里。<|im_end|>"
    },
    {
        "ID": 89,
        "joke": "When I was interviewed for a job in the chemistry department, they asked me if I had lab experience. I said I was more of a cat person.",
        "translation": "当我被化学系面试时，他们问我是否有实验室经验。我说我更喜欢猫。<|im_end|>"
    },
    {
        "ID": 90,
        "joke": "Two skeptics walk into a bar.. I'd tell you what happens next but noone knows",
        "translation": "两个怀疑论者走进了一家酒吧……我本会告诉你接下来发生了什么，但没人知道。<|im_end|>"
    },
    {
        "ID": 91,
        "joke": "Everytime you pull the trigger a bullet loses its job...HAHAHAHA! Because it gets FIRED. HAHAHA! *I'm in tears*",
        "translation": "每次扣动扳机，子弹就会失业……哈哈哈！因为它被发射了。哈哈哈！*我在笑得流泪*<|im_end|>"
    },
    {
        "ID": 92,
        "joke": "It would be great to be born on Earth and die on Mars. Preferably not on the point of impact.",
        "translation": "在地球上出生，在火星上去世会很好。最好是不要死在撞击的那一刻。<|im_end|>"
    },
    {
        "ID": 93,
        "joke": "Descartes walks into the bar. The bartender asks him, \"will you have your usual tonight?\" Rene replies \"I think not\" and he disappears.",
        "translation": "笛卡尔走进酒吧。酒保问他：“你要像往常一样来一杯吗？” 蕾妮回答说：“我想不会了”然后他就消失了。<|im_end|>"
    },
    {
        "ID": 94,
        "joke": "Anyone want to hear my Human Centipede joke? Nah, I won't tell you it. It sucks ass.",
        "translation": "有人想听我讲《人体蜈蚣》的笑话吗？算了，我不告诉你了，不好笑。<|im_end|>"
    },
    {
        "ID": 95,
        "joke": "My dog can predict when an earthquake is going to happen. But television doorbell versus actual doorbell baffles him every time.",
        "translation": "我的狗能预测地震什么时候会发生。但是，电视门铃和实际门铃每次都会让他困惑。<|im_end|>"
    },
    {
        "ID": 96,
        "joke": "My favorite knock knock joke. I need someone to start it ... Someone start the knock knock joke ...",
        "translation": "我最喜欢的“叩叩”笑话。需要有人来开启它……请开始这个“叩叩”笑话……<|im_end|>"
    },
    {
        "ID": 97,
        "joke": "My Parents asked me what i wanted for christmas... I said i want something to wear and something to play with. So they got me a pair of pants with the pockets cut out.",
        "translation": "我的父母问我想要圣诞礼物是什么……我说我想得到一些可以穿的东西和可以玩的东西。所以他们给我买了一条没有口袋的裤子。<|im_end|>"
    },
    {
        "ID": 98,
        "joke": "With 10K characters, I can finally get into great detail about how I'm not allowed at the company family picnic any more!",
        "translation": "拥有10K字符，我终于可以详细说明为什么我不再被允许参加公司的家庭野餐了！<|im_end|>"
    },
    {
        "ID": 99,
        "joke": "[at my funeral] So young, how did he die? He ran into oncoming traffic after walking past a group of adults saying the word \"bae\"",
        "translation": "在我葬礼上：这么年轻，他是怎么去世的？他路过一群成年人说“bae”后，冲进了对面的车流。<|im_end|>"
    },
    {
        "ID": 100,
        "joke": "Stealing my little brother's (fellow Redditor) original joke, hope he sees it and is pissed. What do you get when you cross a pig and a Christmas tree...? A Porky-Pine",
        "translation": "偷了我弟弟（另一位 redditor）的原始笑话，希望他看到后会生气。当你把猪和圣诞树交叉会得到什么……一只“猪松鼠”<|im_end|>"
    },
    {
        "ID": 101,
        "joke": "I lost my virginity to a retarded girl last night. I wanted it to be special",
        "translation": "我昨晚失去了处女膜，对象是个智力有缺陷的女孩。我希望那是一个特别的时刻。<|im_end|>"
    },
    {
        "ID": 102,
        "joke": "What is the biggest compliment you can pay at a gay bar? Pushing in somebody's stool.",
        "translation": "在同性酒吧里，你能给出的最大 compliment 是推某人的凳子。<|im_end|>"
    },
    {
        "ID": 103,
        "joke": "What's a pirate's favourite type of weaponry? It's ARRRtillery! bonus: A pirate's favourite melee weapon? A scimitARRR",
        "translation": "海盗最喜欢的武器类型是什么？当然是“ARRR”炮！额外的：海盗最喜欢的近战武器是“scimitARRR”剑。<|im_end|>"
    },
    {
        "ID": 104,
        "joke": "Hey, who did you vote for?... I wrote in Michael J. Fox. I think he can really shake things up!",
        "translation": "嘿，你投给了谁？……我投给了迈克尔·J·福克斯。我觉得他真的能带来改变！<|im_end|>"
    },
    {
        "ID": 105,
        "joke": "I once had a crippiling masturbation addiction... ...now i have a sex addiction, could you say my addiction has gotten out of hand?",
        "translation": "我曾经有过令人痛苦的自慰成瘾……现在我有了性成瘾，你能说我的成瘾已经失控了吗？<|im_end|>"
    },
    {
        "ID": 106,
        "joke": "*Guy tries giving me his phone number* Me: Oh no thank you. I already have one",
        "translation": "男子试图给我他的电话号码，我说：“不了，谢谢。我已经有一个了。”<|im_end|>"
    },
    {
        "ID": 107,
        "joke": "I'm glad it's the thought that counts because I spend all day thinking about the shit I should be doing.",
        "translation": "我很高兴这只是一个想法的问题，因为我整天都在思考我应该做的事情。<|im_end|>"
    },
    {
        "ID": 108,
        "joke": "A man balks in a war He is discharged for dereliction of duty and takes up drinking.",
        "translation": "一个男人在战争中表现不佳，因失职被开除，于是开始酗酒。<|im_end|>"
    },
    {
        "ID": 109,
        "joke": "Yo mama so lazy she thinks a two-income  family is where yo daddy has two jobs.",
        "translation": "Yo 妈妈 真是 太 懒 了，她 认为 双收入 家庭 就是 你 爸爸 有 两份 工作。<|im_end|>"
    },
    {
        "ID": 110,
        "joke": "Breaking Bad is my favorite documentary about what it takes to be an entrepreneur while balancing family life.",
        "translation": "《绝命毒师》是我最喜欢的关于如何在平衡家庭生活的同时成为企业家的纪录片。<|im_end|>"
    },
    {
        "ID": 111,
        "joke": "What did the gay guy say to his lover when they were going on vacation? \"Hey, can you help me pack my shit?\"",
        "translation": "同性恋男子在度假时对他的伴侣说了什么？“嘿，你能帮我打包我的东西吗？”<|im_end|>"
    },
    {
        "ID": 112,
        "joke": "Coworker: Stop Me: collaborate and listen Coworker: Don't Me: you forget about me Coworker: Hey! Me: teacher, leave them kids alone",
        "translation": "同事：停下我：合作并倾听同事：不要我：你忘了我同事：嘿！我：老师，别管那些孩子了<|im_end|>"
    },
    {
        "ID": 113,
        "joke": "What's an extroverted accountant? One who looks at your shoes while he's talking to you instead of his  own.",
        "translation": "外向的会计师是什么？就是那种在和你说话的时候看着你的鞋子而不是自己的会计师。<|im_end|>"
    },
    {
        "ID": 114,
        "joke": "Dear President Obama, I've got a joke for you... I texted it to Angela Merkel. Did you... *get it*?",
        "translation": "亲爱的奥巴马总统，我有一个笑话想给你讲……我把它发给了安格拉·默克尔。你……*懂了吗*？<|im_end|>"
    },
    {
        "ID": 115,
        "joke": "Sorry, but breaking up with you on facebook was the best way of letting all your friends know I'm available.",
        "translation": "抱歉，但通过在Facebook上分手的方式来让所有朋友知道我有空，这是最好的方法。<|im_end|>"
    },
    {
        "ID": 116,
        "joke": "I don't understand women. I also don't understand how a car works but I still drive it.",
        "translation": "我不懂女人。我也不会修车，但还是会开车。<|im_end|>"
    },
    {
        "ID": 117,
        "joke": "What are the 3 stages of sex after marriage? Tri-weekly Try Weekly and Try Weakly",
        "translation": "婚姻后的性生活有三个阶段：每三周一次、每周一次和每两周一次。<|im_end|>"
    },
    {
        "ID": 118,
        "joke": "My girlfriend is great in bed... But I don't know how my best friend would know that.",
        "translation": "我的女朋友床上很好... 但我也不知道我最好的朋友是怎么知道的。<|im_end|>"
    },
    {
        "ID": 119,
        "joke": "[Justice League HQ] SUPERMAN: Looks like Batman is hungry tonight MOTHMAN: [visibly sweating] I think I'll just fight daytime crimes",
        "translation": "[正义联盟总部] 超人：看来今晚蝙蝠侠饿了。 蝴蝶人：[明显出汗] 我还是去对付白天的犯罪吧。<|im_end|>"
    },
    {
        "ID": 120,
        "joke": "My favourite word is snigger It allows me to be sracist without speople sthinking I'm a sbad sperson",
        "translation": "我最喜欢的词是窃笑。它让我能够进行种族歧视，而不让别人认为我是一个坏人。<|im_end|>"
    },
    {
        "ID": 121,
        "joke": "How do you hide an elephant in a fridge? You remove his slippers and open the door . You put him inside. You close the door and take the slippers away.",
        "translation": "如何在冰箱里藏一头大象？你先脱掉他的拖鞋，然后打开冰箱门，把大象放进去，关上门，再把拖鞋拿走。<|im_end|>"
    },
    {
        "ID": 122,
        "joke": "Pete and repeat are in a boat Pete and repeat are brothers. Pete falls overboard, who's left?",
        "translation": "皮特和重复在一个船上，皮特和重复是兄弟。皮特掉进水里，剩下谁？<|im_end|>"
    },
    {
        "ID": 123,
        "joke": "What did Arnold Schwarzenegger say to the gym manager when he was joining a new gym? I'll re-rack.",
        "translation": "阿诺德·施瓦辛格在加入新健身房时对健身房经理说了什么？我会重新上架。<|im_end|>"
    },
    {
        "ID": 124,
        "joke": "Right now a group of women at a baby shower are simultaneously saying, \"Awwww...\" while some knocked up chick holds up a tiny pair of socks.",
        "translation": "现在一群女性在婴儿茶会上同时发出“啊～”的声音，而一个怀孕的女士举起了两只小小的袜子。<|im_end|>"
    },
    {
        "ID": 125,
        "joke": "Gentlemen test At least most tests have the decency to ask me my name, before they fuck me.",
        "translation": "绅士们测试 至少大多数测试都有 decency（体面）在问我名字之前就进行。（注：原文中的“fuck”一词在中文中较为粗俗，此处翻译为“进行”以避免冒犯。）<|im_end|>"
    },
    {
        "ID": 126,
        "joke": "I went in to hospital for an operation... I asked the anaesthetist if I could administer the needle myself, and he said: \"Sure, knock yourself out\".",
        "translation": "我去医院做手术……我问麻醉师自己能否打针，他说：“当然，随便你。”<|im_end|>"
    },
    {
        "ID": 127,
        "joke": "A piece of shit walks into a bar It's my dad... My dad is a piece of shit.",
        "translation": "一个屎走进了一家酒吧。是我的爸爸……我的爸爸是个屎。<|im_end|>"
    },
    {
        "ID": 128,
        "joke": "What is the last thing that tickle-me elmo gets before he leaves the factory? Two test tickles",
        "translation": "在工厂离开之前，Tickle-Me Elmo 最后会得到什么？是两次测试挠痒。<|im_end|>"
    },
    {
        "ID": 129,
        "joke": "What do you get when you cross a sheep stealer with royalty? Mutton Looter King",
        "translation": "你把羊贼和皇室交叉会得到什么？羊肉掠夺者国王<|im_end|>"
    },
    {
        "ID": 130,
        "joke": "An Indian redditor gets an arranged marriage. He turns to his partner and says: \"Thanks for the gold, kind stranger!\"",
        "translation": "一个印度的 redditor 结了门包办婚姻。他对他的伴侣说：“谢谢你提供的黄金，善良的陌生人！”<|im_end|>"
    },
    {
        "ID": 131,
        "joke": "What do you tell a woman with two black eyes? ..........Nothing you've already told her twice!",
        "translation": "一个女人眼睛下面有两块黑青，你该怎么跟她说？……什么都别说了，你已经说了两遍了！<|im_end|>"
    },
    {
        "ID": 132,
        "joke": "I'd kill for a microwave that plays Europe's \"The Final Countdown\" during the last 30 seconds.",
        "translation": "我愿意为了能在最后30秒播放欧洲的《最终倒计时》而杀死一台微波炉。<|im_end|>"
    },
    {
        "ID": 133,
        "joke": "Did you hear about the skeleton who didn't go to prom? He had no body to go with.",
        "translation": "你听说那个没去舞会的骷髅了吗？因为他没有身体可以一起去。<|im_end|>"
    },
    {
        "ID": 134,
        "joke": "What do you call it when a jugaloo sleeps with his girlfriend after a fight? Make up sex.",
        "translation": "当jugaloo在吵架后和女友同床共枕，这叫什么？弥补性行为。<|im_end|>"
    },
    {
        "ID": 135,
        "joke": "Kids are like farts. You don't mind your own, but others peoples are just unbearable",
        "translation": "孩子们就像放屁一样。你不会介意自己的放屁，但别人的放屁却无法忍受。<|im_end|>"
    },
    {
        "ID": 136,
        "joke": "Over the past year, my sexual fetishes have been slowly getting more perverse. But it wasn't until I spanked a statue that I realised I'd hit rock bottom.",
        "translation": "在过去的一年里，我的性癖好逐渐变得越来越变态。但直到我拍打了一座雕像，我才意识到我已经到了最低点。<|im_end|>"
    },
    {
        "ID": 137,
        "joke": "I milked the cow \"We don't have a cow\" the neighbors' cow then \"Their cat?\" Pretty sure it was a cow he was saying moo \"Meow\" Ah shoot",
        "translation": "我挤了那头牛“我们没有牛”然后是邻居的牛“他们的猫？”我肯定他在说牛“喵”啊，中枪了<|im_end|>"
    },
    {
        "ID": 138,
        "joke": "Dear Shirtless Guy in his Profile Pic, You REALLY want to impress girls? Get a job & pose in front of your cubicle.",
        "translation": "亲爱的赤膊男士，如果你在个人资料图片中，真的想打动女孩们，那就去找份工作，在你的办公隔间前摆个pose吧。<|im_end|>"
    },
    {
        "ID": 139,
        "joke": "The IRA have been fighting for Irish reunification since the 70s. . . All they needed to do was vote for the Conservatives.",
        "translation": "自20世纪70年代以来，爱尔兰共和军一直在为爱尔兰统一而斗争。他们只需要投票支持保守党。<|im_end|>"
    },
    {
        "ID": 140,
        "joke": "How many Reddit admins does it take to change a lightbulb? None, they like to keep the mods in the dark.",
        "translation": "多少Reddit管理员需要更换一个灯泡？不需要，他们喜欢让版主们在黑暗中摸索。<|im_end|>"
    },
    {
        "ID": 141,
        "joke": "Facebook buys Instagram for one billion?!? Idiots!! They could have downloaded it from the app store for .99 cents..",
        "translation": "Facebook以十亿美元收购Instagram？！蠢蛋们！他们本可以花0.99美元从应用商店下载它。<|im_end|>"
    },
    {
        "ID": 142,
        "joke": "I may not be getting laid tonight, but I'm definitely banging my snooze button in the morning.",
        "translation": "今晚可能不会有人找我上床，但我会在早上狠狠地按我的闹钟。<|im_end|>"
    },
    {
        "ID": 143,
        "joke": "I want to make a series about the murder of an airline crew but I still have to shoot the pilot.",
        "translation": "我想制作一个关于空乘人员谋杀案的系列剧，但仍然需要拍摄飞行员。<|im_end|>"
    },
    {
        "ID": 144,
        "joke": "My friend always wanted to work in animation, but never got past the interview He just couldn't understand the difference between a professional \"colorist\" and a professional \"racist\"",
        "translation": "我的朋友一直梦想在动画行业工作，但从未通过面试。他就是不明白专业“调色师”和专业“种族主义者”之间的区别。<|im_end|>"
    },
    {
        "ID": 145,
        "joke": "[sees a zebra for the first time] What's up with that horse? [sees a giraffe for the first time] Okay, what the hell is going on today?",
        "translation": "第一次看到斑马时：这匹马怎么了？第一次看到长颈鹿时：今天到底发生了什么鬼事？<|im_end|>"
    },
    {
        "ID": 146,
        "joke": "so as I went in to vote this morning, an old lady told me to make sure I voted for the candidate that could make change. Boy, is my bank teller going to be surprised!",
        "translation": "所以今天早上我去投票时，一位老妇人告诉我一定要为那个能找零的候选人投票。天哪，我的银行出纳员肯定会大吃一惊！<|im_end|>"
    },
    {
        "ID": 147,
        "joke": "You're so fat and unfunny... that the only punchlines you have are stained on your shirt.",
        "translation": "你又胖又没幽默感……你的笑点只有衬衫上的污渍。<|im_end|>"
    },
    {
        "ID": 148,
        "joke": "Glue is weird it's all like hey I want to stick these pieces of paper together wait I have an idea hand me that dead horse",
        "translation": "胶水真是奇怪，它总是这样：嘿，我想把这些纸粘在一起，等等，我有个主意，给我那匹死马。<|im_end|>"
    },
    {
        "ID": 149,
        "joke": "Why are women and children evacuated first in a disaster? So we can think about a solution in silence",
        "translation": "为什么在灾难中要先撤离妇女和儿童？这样我们可以在安静中思考解决方案。<|im_end|>"
    },
    {
        "ID": 150,
        "joke": "Waiting for the day when a girl finally says that I'm \"the one,\" but isn't talking to a police officer.",
        "translation": "等待着有一天，一个女孩终于对我说我是“对的那个人”，但不是在和警察说话。<|im_end|>"
    },
    {
        "ID": 151,
        "joke": "Some people say Glenn Frey got pneumonia from the cold... But that can't be true because he said the Heat is On.",
        "translation": "有些人说格伦·弗莱是因为感冒而得了肺炎……但这不可能是真的，因为他曾经说过“热度不减”。<|im_end|>"
    },
    {
        "ID": 152,
        "joke": "What is the best part about having sex with 23 year olds? There's 20 of them. (Works better in person)",
        "translation": "与23岁的年轻人发生性关系的最佳之处在于，有20个。 （现场效果更佳）<|im_end|>"
    },
    {
        "ID": 153,
        "joke": "My love for you is like a fart. Everything about it is powered by my heart.",
        "translation": "我对你的爱就像放屁一样，每一方面都由我的心驱动。<|im_end|>"
    },
    {
        "ID": 154,
        "joke": "What did the Mexican gang member say when two large houses fell on him during an earthquake? Get off me, homes.",
        "translation": "当墨西哥帮派成员在地震中被两栋大房子压住时，他说了什么？滚开，伙计们。<|im_end|>"
    },
    {
        "ID": 155,
        "joke": "I once bought an e. e. cummings poem collection.. It was the worst game of Mad Libs ever.",
        "translation": "我曾经买过一本e. e. 姆金斯的诗集……那简直是最糟糕的mad libs游戏。<|im_end|>"
    },
    {
        "ID": 156,
        "joke": "Why is it that the more numbers someone has in their e-mail address, the less I respect them?",
        "translation": "为什么邮箱地址里的数字越多，我就越不尊重他们？<|im_end|>"
    },
    {
        "ID": 157,
        "joke": "If you ever need help learning C++, I can give you some pointers. And you can keep me as a reference.",
        "translation": "如果你需要帮助学习C++，我可以给你一些指点，并且你可以把我当作参考。<|im_end|>"
    },
    {
        "ID": 158,
        "joke": "What have you done wrong if the wife keep complaining when you try to watch TV in the living room? You made the chain too long in the kitchen.",
        "translation": "如果你的妻子在你试图在客厅看电视时不停地抱怨，你做错了什么？你把厨房的链子弄得太长了。<|im_end|>"
    },
    {
        "ID": 159,
        "joke": "Don't buy whitening toothpaste It says guaranteed whiteness in 14 days. 15 days have come and gone... and I am still asian.",
        "translation": "不要买美白牙膏，它声称14天内保证美白。15天过去了……我还是亚洲人。<|im_end|>"
    },
    {
        "ID": 160,
        "joke": "Simba - \"welcome to... The bone zone\" Nala - \"the what?\" Simba - \"elephant graveyard. I said elephant graveyard\"",
        "translation": "辛巴：“欢迎来到……骨头区”娜拉：“什么？骨头区？”辛巴：“大象墓地。我说的是大象墓地。”<|im_end|>"
    },
    {
        "ID": 161,
        "joke": "How are doctors so well tempered even under heavy stress? They have a lot of patients",
        "translation": "医生们即使在巨大的压力下仍然性格坚韧，这是为什么呢？因为他们有很多病人。<|im_end|>"
    },
    {
        "ID": 162,
        "joke": "I wonder if dog's had facebook, would they put our picture as their profile picture.",
        "translation": "我想知道如果狗有Facebook，它们会不会把我们的照片作为他们的个人头像。<|im_end|>"
    },
    {
        "ID": 163,
        "joke": "Why are Native Americans the most successfull strippers? Because when they dance, they make it rain.",
        "translation": "为什么原住民是最成功的脱衣舞者？因为他们跳舞时会“下雨”。<|im_end|>"
    },
    {
        "ID": 164,
        "joke": "My ex-girlfriend was a slut. She bust more nuts than a pistachio junkie. edit: Going through a potential breakup, so if you see this, this isnt about you, babe. Dont leave me, please.",
        "translation": "我的前女友是个荡妇。她比 Pistachio 痴迷者还爱射精。编辑：正处于可能分手的阶段，如果你看到了，这并不是针对你，亲爱的。别离开我，请。<|im_end|>"
    },
    {
        "ID": 165,
        "joke": "Why Did the Ebola Patient Cross the Road? Trick question. There are no roads in Africa.",
        "translation": "为什么埃博拉病人要过马路？这是一个陷阱问题。在非洲没有马路。<|im_end|>"
    },
    {
        "ID": 166,
        "joke": "ME: Haha you can tell them any name and they have to say it BARISTA: I have a latte for \"A Person Who Deserves Love\"? ME [crying]: Hahaha",
        "translation": "服务员：我有一杯拿铁给“值得爱的人”？我：哈哈，他们可以随便起名字，我就叫他们“值得爱的人”吧。我：哈哈哈哈哈<|im_end|>"
    },
    {
        "ID": 167,
        "joke": "Peter Pan escaped the adult world... ...by becoming an alcoholic. He goes by Peter the Panhandler now.",
        "translation": "彼得·潘逃出了成人世界……靠成为一名酒鬼。他现在被称为彼得·潘手。<|im_end|>"
    },
    {
        "ID": 168,
        "joke": "My Grandfather had the heart of a lion and a lifetime ban from the zoo.",
        "translation": "我的祖父有一颗狮子的心，却终身被动物园禁止。<|im_end|>"
    },
    {
        "ID": 169,
        "joke": "You just know I knew my girlfriend was furious when I blew my load early last night....I could see it in her eyes",
        "translation": "你当然知道当我昨晚过早射精时，我女朋友一定很生气……我能从她的眼神中看出来<|im_end|>"
    },
    {
        "ID": 170,
        "joke": "An atheist, a vegan, and a crossfit fanatic walk into a bar... Who talks more?",
        "translation": "无神论者、素食主义者和CrossFit狂热者走进一家酒吧……谁说得更多？<|im_end|>"
    },
    {
        "ID": 171,
        "joke": "How is light beer like having sex in a canoe? They're both fucking close to water.",
        "translation": "轻啤酒就像在独木舟里做爱，因为两者都离水很近。<|im_end|>"
    },
    {
        "ID": 172,
        "joke": "How many tickles does it take to make an octopus laugh? Ten-tickles. I'll see myself out.",
        "translation": "多少次挠才能让八爪鱼笑出来？十次挠。我自己出去了。<|im_end|>"
    },
    {
        "ID": 173,
        "joke": "What do you get when you cross an insomniac, agnostic and a dyslexic? Someone who stays up all night wondering if there is a Dog.",
        "translation": "失眠者、无神论者和阅读障碍者之间的交叉结果是什么？是一个整晚都在怀疑是否有“狗”的人。<|im_end|>"
    },
    {
        "ID": 174,
        "joke": "I farted in the Apple store and everyone got pissed at me. Not my fault they don't have Windows.",
        "translation": "我在苹果商店放了个屁，大家都很生气。这不怪他们没有Windows。<|im_end|>"
    },
    {
        "ID": 175,
        "joke": "I left Stephen Hawking like 8 voice mail messages before I realised he'd picked up every time.",
        "translation": "我在意识到史蒂芬·霍金每次都会接电话之前，给他留了八条语音邮件。<|im_end|>"
    },
    {
        "ID": 176,
        "joke": "My terrible Joke but I never forget it. A dyslexic man walked into a bra....",
        "translation": "一个患阅读障碍的男子走进了一间……<|im_end|>"
    },
    {
        "ID": 177,
        "joke": "Believe it or not, my wife and I were actually matched on Tinder. We'd been married for 12 years.",
        "translation": "信不信由你，我和妻子实际上是在 Tinder 上匹配成功的。我们已经结婚12年了。<|im_end|>"
    },
    {
        "ID": 178,
        "joke": "I scream, you scream, we all scream for ice cream. This kid working at Baskin Robbins is pretty scared. Now he's crying in the corner.",
        "translation": "我喊，你喊，我们全都喊着要吃冰淇淋。现在这个在芭丝特罗宾工作的孩子挺害怕的。他现在在角落里哭了起来。<|im_end|>"
    },
    {
        "ID": 179,
        "joke": "So a Trabi owner pulls up to a gas station... ...and says to the attendant: \"Two windscreen wipers for my Trabi please.\" The attendant replies: \"That sounds like a good deal!\"",
        "translation": "所以一位捷达车主开到加油站……并对服务员说：“请给我装两根刮水器，我的捷达。”服务员回答说：“这听起来是个好 deal！”<|im_end|>"
    },
    {
        "ID": 180,
        "joke": "How many police officers does it take to change a light bulb? None, because they'll just beat the room for being black!",
        "translation": "多少警察才能换一个灯泡？一个都不用，因为他们会把房间里的黑人打一顿！<|im_end|>"
    },
    {
        "ID": 181,
        "joke": "Why did the semen cross the road? Because I put on the wrong pair of socks this morning.",
        "translation": "为什么精液过马路？因为我今天早上穿错了袜子。<|im_end|>"
    },
    {
        "ID": 182,
        "joke": "If you're not one of the first five boys in the yard, you almost never get a milkshake.",
        "translation": "如果你不是院子里前五名的男孩之一，几乎 never 会得到奶昔。<|im_end|>"
    },
    {
        "ID": 183,
        "joke": "Every woman I've ever been with only saw me the way they wanted to see me... ...in their rearview mirror.",
        "translation": "我遇到过的每一个女人，都只是从她们自己的后视镜里看到我，而那并不是我真正的样子。<|im_end|>"
    },
    {
        "ID": 184,
        "joke": "How do you figure out which contestant in a Ms. America pageant is a prostitute? Look for the one with the sash that says \"I da ho\".",
        "translation": "如何在Miss America选美比赛中找出哪个参赛者是妓女？看看那个佩戴写着“I da ho”绶带的人。<|im_end|>"
    },
    {
        "ID": 185,
        "joke": "I love raccoons. Part cat. Part dog. Part rodent. Part bear. Little people hands. What's not to like?",
        "translation": "我喜欢浣熊。一半像猫。一半像狗。一半像啮齿动物。一半像熊。还有小人的手。还有什么不喜欢的？<|im_end|>"
    },
    {
        "ID": 186,
        "joke": "[Google search history] Moles How to kill moles How to make homemade bombs Rescue moles from cave-in Dealing with regret Mole stew",
        "translation": "[谷歌搜索历史] 蚁丘 如何杀死蚂蚁 如何制作自制炸弹 营救陷洞中的蚂蚁 如何应对后悔 蚁汤<|im_end|>"
    },
    {
        "ID": 187,
        "joke": "Standing in the park, I was wondering why a Frisbee gets larger the closer it gets. And then it hit me.",
        "translation": "站在公园里，我在想为什么飞盘越靠近就越显得大。然后我明白了。<|im_end|>"
    },
    {
        "ID": 188,
        "joke": "When in doubt, just do the opposite of whatever the person wearing pajamas in public is doing.",
        "translation": "当感到不确定时，就做那个在公共场合穿着睡衣的人所做事情的相反动作。<|im_end|>"
    },
    {
        "ID": 189,
        "joke": "[Ouija board] Spirits are you there? U R C U T E D O Y O U H A V E K I K *flips board*",
        "translation": "[奥卡贾板] 灵魂们，你们在吗？你被切了？你有踢*板子翻转*<|im_end|>"
    },
    {
        "ID": 190,
        "joke": "Not being able to read because your book ran out of batteries is a pretty hilarious first-world problem.",
        "translation": "因为书没电了而无法阅读，这真是一个相当好笑的发达国家问题。<|im_end|>"
    },
    {
        "ID": 191,
        "joke": "My internet connection on my farm was be terrible until I moved the router in the horse barn. Now I have stable WiFi.",
        "translation": "我的农场里的互联网连接一直很糟糕，直到我把路由器搬到了马厩里。现在我有了稳定的WiFi。<|im_end|>"
    },
    {
        "ID": 192,
        "joke": "What does a sheep call a film it doesn't like? a baaahhhd movie. (   )",
        "translation": "绵羊不喜欢的电影叫什么？糟糕的电影（baaahhhd movie）。<|im_end|>"
    },
    {
        "ID": 193,
        "joke": "Brexit There is a new slimming product in town. It is called Brexit. It'll help you lose a lot of pounds.",
        "translation": "脱欧市场上出现了一款新的减肥产品，叫做“脱欧”。它能帮助你减掉很多磅。<|im_end|>"
    },
    {
        "ID": 194,
        "joke": "Orange Julius is the third best thing to happen to oranges behind mimosas and the \"orange you glad I didn't say banana\" knock knock joke",
        "translation": "橙汁是橙子发生的第三好事，仅次于莫吉托和“橙你”高兴我没说香蕉”的双关笑话。<|im_end|>"
    },
    {
        "ID": 195,
        "joke": "Why do golfers wear 2 pairs of pants? Incase he gets a hole in one",
        "translation": "为什么高尔夫球手要穿两件裤子？以防打出一杆进洞。<|im_end|>"
    },
    {
        "ID": 196,
        "joke": "How do you stop a baby from crawling in circles? Nail its other hand to the floor.",
        "translation": "怎样阻止婴儿爬圈圈？把它的另一只手钉在地上。<|im_end|>"
    },
    {
        "ID": 197,
        "joke": "Two fish are in a tank... One is driving, and the other is manning the guns.",
        "translation": "两个鱼在水族箱里... 一个在开车，另一个在操作枪支。<|im_end|>"
    },
    {
        "ID": 198,
        "joke": "Steve wrote home. 'I'm glad you named me  Steve' he said in the letter. 'Why?' asked his mother in her reply. 'Because that's what all the kids at camp call me' he wrote  back.",
        "translation": "史蒂夫给家里写了信。“我很高兴你给我取名史蒂夫，”他在信中说道。“为什么？”母亲在回信中问道。“因为夏令营里的所有孩子都叫我史蒂夫，”他回信说。<|im_end|>"
    },
    {
        "ID": 199,
        "joke": "Whilst at college I did experiment with marijuana. I did it in snow, I did it in sleet, but I did not in hail. ^-- ^Ed ^Byrne",
        "translation": "在大学时，我曾尝试使用大麻。我在雪中使用过，也在雨夹雪中使用过，但从未在冰雹中使用过。 ^-- ^Ed ^Byrne<|im_end|>"
    },
    {
        "ID": 200,
        "joke": "I paid 10.50 for a movie ticket to watch Tom Cruise die continuously for 2 hours. I would have paid a hundred dollars to watch that.",
        "translation": "我花了10.50元买了一张电影票，只是为了观看汤姆·克鲁斯连续死去两个小时。我愿意花一百美元来看那部电影。<|im_end|>"
    },
    {
        "ID": 201,
        "joke": "A Spanish magician announced that for his final trick, he would vanish into thin air. He counted down: uno, dos, then POOF! He was gone, without a tres.",
        "translation": "一个西班牙魔术师宣布他的最后一个魔术是消失在空气中。他倒数：uno，dos，然后砰的一声！他消失了，连“tres”都没来得及说。<|im_end|>"
    },
    {
        "ID": 202,
        "joke": "Is that mine? I was walking down the street when I saw black guy with a laptop. Is that mine? I thought. It looks exactly like mine... but that can't be... Mine should be at home cleaning my shoes.",
        "translation": "那是我的吗？我正在街上走，看到一个黑人拿着一台笔记本电脑。那是我的吗？我觉得它看起来和我的一模一样……但这不可能……我的应该在家里擦鞋。<|im_end|>"
    },
    {
        "ID": 203,
        "joke": "A Bug's Mind What's the last thing that goes through a bug's mind when he crashes into a windshield? His asshole.",
        "translation": "一只虫子撞到挡风玻璃的最后一 thought 是他的肛门。<|im_end|>"
    },
    {
        "ID": 204,
        "joke": "My mom recently bought a Jesus shaped flashlight When I asked her why she said: So whenever someone says \"I can't see\" I can be like \"here, let Jesus light the path\"",
        "translation": "妈妈最近买了一个耶稣形状的 flashlight。当我问她为什么买的时候，她说：“这样每当有人抱怨‘看不见’时，我就可以说‘让我让耶稣来照亮你的路’。”<|im_end|>"
    },
    {
        "ID": 205,
        "joke": "Why is my Chinese girlfriend so bitchy? Well it's true, you are what you eat.",
        "translation": "为什么我的中国女朋友那么 bitchy？嗯，说实在的，你就是你吃的东西。<|im_end|>"
    },
    {
        "ID": 206,
        "joke": "The hotel we stayed in for our holiday offered bed and board but it was impossible to say which was the bed and which was the board.",
        "translation": "我们在度假时入住的酒店提供食宿，但很难分辨什么是床，什么是板。<|im_end|>"
    },
    {
        "ID": 207,
        "joke": "My new cooking show, \"Will Sasso Cooks With His Exposed Dick Really Close to the Food\" premieres tonight (8/7 Central) in my mind. Be there!",
        "translation": "我的新烹饪节目《威尔·萨索裸露的阳具真的会靠近食物吗》今晚（中部时间8/7）首播，就在我的脑海中。快来参加吧！<|im_end|>"
    },
    {
        "ID": 208,
        "joke": "*nose hairs growing out of control *buys tiny scissors *jam them in the eyes of whoever I catch staring at my nose hairs",
        "translation": "*鼻毛疯长 *买了一把小剪刀 *逮到谁看我的鼻毛就往谁的眼睛里插<|im_end|>"
    },
    {
        "ID": 209,
        "joke": "I'm trying to write a poem for my girlfriend, does anyone know what rhymes with threesome?",
        "translation": "我在为女朋友写诗，有没有人知道“三陪”押什么韵？<|im_end|>"
    },
    {
        "ID": 210,
        "joke": "Pro tip: If a woman asks you how she looks, the correct answer is not \"like Dan Aykroyd.\"",
        "translation": "提示：如果一个女人问你她穿什么衣服好看，正确的回答不是“像丹·艾克罗伊德”。<|im_end|>"
    },
    {
        "ID": 211,
        "joke": "I complained to my wife that I was short staffed at work She responded \"yeah, and you have the same problem at home\"",
        "translation": "我向妻子抱怨工作上人手不足，她回答说：“是啊，你在家也面临同样的问题。”<|im_end|>"
    },
    {
        "ID": 212,
        "joke": "I overheard two female coworkers say there was a creepy dude listening to their conversation.",
        "translation": "我听到两个女同事说有个 creep 坑人 在听她们的谈话。<|im_end|>"
    },
    {
        "ID": 213,
        "joke": "What's black and white and red all over and can't get through a revolving door? A nun with a spear through her head.",
        "translation": "什么东西又黑又白还满脸通红，却过不了旋转门？是一位头中长矛的修女。<|im_end|>"
    },
    {
        "ID": 214,
        "joke": "What did the Marine Biologist say when he saw two eels making love? \"It's a Moray.\"",
        "translation": "海洋生物学家看到两条鳗鱼在做爱时说了什么？“这就是一条Moray。”<|im_end|>"
    },
    {
        "ID": 215,
        "joke": "I submitted 10 of my best puns to a Joke competition expecting at least 1 to win, but... No pun in ten did..",
        "translation": "我提交了10个我最好的双关语参加了一个笑话比赛，本指望至少有一个能获奖，但……十个双关语一个也没中。<|im_end|>"
    },
    {
        "ID": 216,
        "joke": "Shoutout to people who don't know what the opposite of in is. I'll give you some time for this one.",
        "translation": "向那些不知道“in”的反义词是什么的人致敬。我给你们一点时间来思考这个问题。<|im_end|>"
    },
    {
        "ID": 217,
        "joke": "ME: all the King's horses and men couldn't put u back together HUMPTY DUMPTY: what now M: [opening package of bacon] I'll think of something",
        "translation": "ME：所有的国王的马和士兵都无法把你拼回去。HUMPTY DUMPTY：现在怎么办？ME：[打开一包培根] 我会想出办法的。<|im_end|>"
    },
    {
        "ID": 218,
        "joke": "How many Alzheimer's patients does it take to screw on a light bulb? TO GET TO THE OTHER SIDE!",
        "translation": "多少阿尔茨海默病患者才能拧上一个灯泡？去到另一边！<|im_end|>"
    },
    {
        "ID": 219,
        "joke": "If chopsticks were really better than a fork... ...wouldn't we be digging ditches with pool cues?",
        "translation": "如果筷子真的比叉子好用，那我们不是应该用球杆挖沟吗？<|im_end|>"
    },
    {
        "ID": 220,
        "joke": "First woman on the moon W: Houston, we have a problem H: What is it? W: Nevermind its nothing H: What is the problem? W: Nothing... H: Tell us what the problem is! W: NO!",
        "translation": "第一位登月的女性：休斯敦，我们有个问题。休斯敦：什么问题？第一位登月的女性：算了，没什么。休斯敦：到底是什么问题？第一位登月的女性：不行！<|im_end|>"
    },
    {
        "ID": 221,
        "joke": "Thank god I have the newest, fastest iPhone so I can mindlessly check the same three apps 500 times a day.",
        "translation": "感谢天，我有了最新最快的iPhone，这样我就可以一天不厌其烦地反复查看那三个应用程序500次了。<|im_end|>"
    },
    {
        "ID": 222,
        "joke": "Jared Fogle was guilty and got 16 years He was just grateful for anything under 18. Credit to SNL that joke might have converted me to watch.",
        "translation": "杰拉德·福格有罪，被判16年监禁，他对此表示感激，只希望不要超过18年。感谢《周六夜现场》的这个笑话，它可能让我决定观看节目。<|im_end|>"
    },
    {
        "ID": 223,
        "joke": "This hating of people who breast feed in public places has to stop! I'll raise my dog however I like.",
        "translation": "这种在公共场所厌恶母乳喂养的行为必须停止！我养狗怎么养就怎么养。<|im_end|>"
    },
    {
        "ID": 224,
        "joke": "A woman's JJ sized breasts saved her life in a car accident. Those same breasts were the cause of her husbands death in a motorboating accident.",
        "translation": "一个女人的JJ尺寸的乳房在车祸中救了她的命。而在一次摩托艇事故中，同样的乳房却导致了她丈夫的死亡。<|im_end|>"
    },
    {
        "ID": 225,
        "joke": "Recent studies show that 1 out of 3 Americans weigh as much as the other 2 put together.",
        "translation": "最近的研究显示，美国人的体重中有三分之一等于另外三分之二的总和。<|im_end|>"
    },
    {
        "ID": 226,
        "joke": "[date gets back from the bathroom] those batman toys in the tub are so cute! How old are your kids? \"kids?\"",
        "translation": "[日期从洗手间回来]浴缸里的蝙蝠侠玩具好可爱啊！你家有小孩吗？\"小孩？\"<|im_end|>"
    },
    {
        "ID": 227,
        "joke": "I just Googled 'Nicolas Cage jokes' and it showed me a list of every film he's been in. Well played, Google.",
        "translation": "我刚刚在谷歌上搜索了“尼古拉斯·凯奇的笑话”，结果它给我列出了他参演过的每一部电影。谷歌，你真会玩。<|im_end|>"
    },
    {
        "ID": 228,
        "joke": "I've been listening to the official workout station on Pandora for 3 months and I'm still fat, I'm calling bullshit.",
        "translation": "我已经在潘多拉上的官方健身电台听了三个月，还是那么胖，我要举报这是假的。<|im_end|>"
    },
    {
        "ID": 229,
        "joke": "I was going to break up a fight between two Rabbis... But they were just arguing semitics.",
        "translation": "我去调解两位拉比之间的斗殴……但他们只是在争论语义学。<|im_end|>"
    },
    {
        "ID": 230,
        "joke": "Pavlov's doorbell One tuesday afternoon Ivan Pavlov is reading the paper, when his neighbour rings the doorbell. Ivan jumps up out of his chair, suddenly remembering: \"Shit, I need to feed the dogs!\"",
        "translation": "巴甫洛夫的门铃 一天下午，伊凡·巴甫洛夫正在读报纸，这时邻居按响了门铃。伊凡从椅子上跳起来，突然想起：“该死，我得去喂狗了！”<|im_end|>"
    },
    {
        "ID": 231,
        "joke": "What did one tampon say to the other tampon? Nothing they were both stuck up cunts.",
        "translation": "一个卫生棉条对另一个卫生棉条说了什么？它们都没说话，因为它们都被塞住了。<|im_end|>"
    },
    {
        "ID": 232,
        "joke": "HER: You look so nervous. ME: *nervously* HA. I'm never nervous. HER: You're sweating. ME: *just freaking out* That's bravery moisture.",
        "translation": "她：你看起来好紧张。我：（紧张地）哈哈，我从不紧张。她：你都在出汗了。我：（更加紧张地）那是勇敢的汗水。<|im_end|>"
    },
    {
        "ID": 233,
        "joke": "When I was 8 years old, my dad got me with the worst dad joke ever. He said he was going to the store and would be back soon...",
        "translation": "当我8岁的时候，我爸爸给我讲了有史以来最烂的爸爸笑话。他说他要去商店，很快就回来……<|im_end|>"
    },
    {
        "ID": 234,
        "joke": "Do you hate yourself? Do you wish someone would trip you down stairs? Do you enjoy lacerations & and surprise vomit piles? *hands you a cat*",
        "translation": "你恨自己吗？你希望有人能在楼梯上绊倒你吗？你喜欢割伤自己和突然呕吐的堆子吗？*递给你一只猫*<|im_end|>"
    },
    {
        "ID": 235,
        "joke": "I found where my mom hid the scissors, so everyone in my house woke up with a new haircut this morning.",
        "translation": "我找到了妈妈藏剪刀的地方，所以今天早上我们家每个人都理了新发型。<|im_end|>"
    },
    {
        "ID": 236,
        "joke": "What is the best thing about twenty six year olds? There are twenty of them",
        "translation": "26岁最好的地方是，他们有二十个。<|im_end|>"
    },
    {
        "ID": 237,
        "joke": "Why was there semen on the clean laundry? When Greg woke up, his mom had left a note reading, \"Please put a load in the washer\"",
        "translation": "为什么干净的洗衣篮里有精液？当格雷格醒来时，他妈妈留下了一张纸条，上面写着：“请放一负载进洗衣机里。”<|im_end|>"
    },
    {
        "ID": 238,
        "joke": "I once was bored so I decided to eat a clock to *pass the time*. It was very *time consuming*. Yuk yuk yuk yuk yuk",
        "translation": "我曾经无聊，于是决定吃一个钟表来打发时间。这非常耗时。呕呕呕呕呕<|im_end|>"
    },
    {
        "ID": 239,
        "joke": "Have you ever seen those \"Give a penny, take a penny\" things at convenience stores??? that makes no cents",
        "translation": "你有没有见过那些便利店里的“投一便士，拿一便士”那种东西？这根本就没有分文。<|im_end|>"
    },
    {
        "ID": 240,
        "joke": "Me: .... Dog: ... Me: .... Dog: ... Me: ... Dog: ... Me: .... Dog: ... Me: ... Dog: ... Me: ... Dog: have the shrooms kicked-in yet? Me: ..",
        "translation": "我：…… 狗：…… 我：…… 狗：…… 我：…… 狗：…… 我：…… 狗：蘑菇被踢了吗？ 我：……<|im_end|>"
    },
    {
        "ID": 241,
        "joke": "I bet if I were a MAN Apple wouldn't tell me my password ideas are weak.",
        "translation": "我打赌，如果我是男性，苹果就不会告诉我我的密码想法很弱。<|im_end|>"
    },
    {
        "ID": 242,
        "joke": "if people really didn't want to hear smartass responses they wouldn't keep asking questions like \"do you know why i pulled you over?\"",
        "translation": "如果人们真的不想听到那些自以为是的回答，他们就不会不停地问“你知道我为什么把你拦下来吗？”<|im_end|>"
    },
    {
        "ID": 243,
        "joke": "I have this fun drinking game where you take a drink every time you'd like one because you're an adult and you can make decisions yourself.",
        "translation": "我有一个有趣的饮酒游戏，每当你想要喝酒的时候就喝一杯，因为你是个成年人，可以自己做决定。<|im_end|>"
    },
    {
        "ID": 244,
        "joke": "I'm sorry, Black Lives Matter is actually a peaceful and forward thinking movement that our society needs... Now if you could all stop sending me death threats on twitter that would be great.",
        "translation": "对不起，黑人的命也是命其实是一个和平且前瞻性的运动，我们的社会确实需要这样的运动……现在，如果你们都能停止在推特上向我发送死亡威胁，那就太好了。<|im_end|>"
    },
    {
        "ID": 245,
        "joke": "My girlfriend left me after I broke her wheelchair..... Oh,, I think she'll come crawling back soon..",
        "translation": "我的女朋友因为我弄坏了她的轮椅而离开了我……哦，我想她很快就会回来的。<|im_end|>"
    },
    {
        "ID": 246,
        "joke": "Someone should invent a version of Twitter for people who spell things like rappers. They could call it \"twita\". Dat would b nize",
        "translation": "有人应该发明一个专门为拼写像说唱歌手那样的人设计的推特版本，他们可以称之为“twita”。那会很好。<|im_end|>"
    },
    {
        "ID": 247,
        "joke": "NSFW Men are like a deck of cards... You need a heart to love him, a diamond to marry him, a club to smash his fucking face in and a spade to bury the bastard!",
        "translation": "男人就像一副扑克牌……你需要一颗心来爱他，一颗钻石来娶他，一颗方片来砸碎他的狗脸，一颗黑桃来埋了这个王八蛋！<|im_end|>"
    },
    {
        "ID": 248,
        "joke": "THE HORROR! *splat THE TRAGEDY! *splat IT'S AWFUL! *splat SO MUCH BLOOD! *splat WHY IS THIS HAPPENING?! *splat -It's raining men.",
        "translation": "恐怖！ *啪 THE TRAGEDY！ *啪 太可怕了！ *啪 好多血！ *啪 为什么会发生这种情况？！ *啪 -天在下雨呢。<|im_end|>"
    },
    {
        "ID": 249,
        "joke": "Guy comes home with a flower bouquet... \"Guess I'll have to spread my legs now\", says the wife. \"Why? Don't you have a vase?\" the husband replies.",
        "translation": "丈夫带了一束花回家，妻子说：“那我得张开腿了。”丈夫反问道：“为什么？你没有花瓶吗？”<|im_end|>"
    },
    {
        "ID": 250,
        "joke": "Two rabbits were being chased by a pack of wild dogs... One says to the other \"should we stop and outnumber them?\" ... &amp;nbsp; \"keep running you fool we're brothers!!\"",
        "translation": "两只兔子正被一群野狗追逐……一只兔子对另一只说：“我们应该停下来，以数量优势对付他们吗？”……另一只兔子回答：“继续跑你这个傻瓜，我们是兄弟！”<|im_end|>"
    },
    {
        "ID": 251,
        "joke": "No one is more unnecessarily confident than a white person that just ordered Mexican food in a Spanish accent.",
        "translation": "没有人比刚用西班牙口音点墨西哥菜的白人更有不必要的自信了。<|im_end|>"
    },
    {
        "ID": 252,
        "joke": "What do you call it when two designers argue about what file type to export a graphic to? Getting into a bit of a .tiff!",
        "translation": "当两个设计师争论应该将图形导出为什么种文件格式时，这就叫做陷入了“.tiff”之争！<|im_end|>"
    },
    {
        "ID": 253,
        "joke": "A doctor reaches into his pocket and finds his rectal thermometer He says \"Shit, some asshole took my pen!\"",
        "translation": "医生把手伸进口袋，发现里面有一个直肠温度计，他说道：“该死的，某个混蛋拿走了我的钢笔！”<|im_end|>"
    },
    {
        "ID": 254,
        "joke": "how many people does it take to save the world? zero (compliments to my SO who thinks she made this up)",
        "translation": "拯救世界需要多少人？零（献给我的女友，她认为自己想出了这个笑话）<|im_end|>"
    },
    {
        "ID": 255,
        "joke": "Finally got around to shaving my crotch after a few years. Its nice to see my knees again.",
        "translation": "终于有时间把腿毛给剃了，几年没剃了，又见膝盖了，感觉挺好的。<|im_end|>"
    },
    {
        "ID": 256,
        "joke": "I'm ready for the cop-buddy film where they actually get along in the beginning but hate each other by the end.",
        "translation": "我准备好要看那种警匪片了，一开始他们还互相配合，结果到后来却互相讨厌。<|im_end|>"
    },
    {
        "ID": 257,
        "joke": "How many people does it take to change a light bulb in Brazil? A Brazillion!!! http://imgur.com/c4CJjUd",
        "translation": "多少人才能在巴西换一个灯泡？一打巴西人！！！-http://imgur.com/c4CJjUd<|im_end|>"
    },
    {
        "ID": 258,
        "joke": "If two people had a race and one had sand in his shoe but the other did not, who would win? The one with sand in his shoe -- if it was quicksand.",
        "translation": "如果两个人比赛，一个鞋子里有沙子，另一个没有，谁会赢？是鞋子里有沙子的那个人——如果那是流沙。<|im_end|>"
    },
    {
        "ID": 259,
        "joke": "I know dream catchers don't work because I've never seen one in a car worth more than two thousand dollars.",
        "translation": "我知道梦网器不起作用，因为我从未见过价值超过两千元的汽车里有梦网器。<|im_end|>"
    },
    {
        "ID": 260,
        "joke": "At my last checkup the doctor said he needed a urine sample, a semen sample and a stool sample ... ... I said \" Doc, I can speed this along - I'll just leave you my underwear !\"",
        "translation": "在我上次的体检中，医生说我需要提供尿样、精液样和粪便样……我说：“医生，我可以加快这个过程——我直接把内裤给你吧！”<|im_end|>"
    },
    {
        "ID": 261,
        "joke": "[pulls out acoustic guitar at a funeral] alright everyone stop being all [finger quotes] sad this next 1 is dedicated to a very sexy widow.",
        "translation": "[在葬礼上拿出 acoustic 吉他] 大家都停下来，别这么 [比划手指] 伤心了。接下来这个是献给一位非常性感的寡妇的。<|im_end|>"
    },
    {
        "ID": 262,
        "joke": "If there are three gay guys in a bath and a lump of cum floats to the surface, what do they say? Who farted?",
        "translation": "如果有三个同性恋男子在浴缸里，然后一坨精液浮到了水面上，他们会说什么？谁放屁了？<|im_end|>"
    },
    {
        "ID": 263,
        "joke": "Why the gills in the sea don't drink tea even though there is plenty of water That will make them all guill tea!",
        "translation": "为什么海里的鱼鳃不喝茶，尽管水很多，那会让它们都变成“ Guill 茶”！<|im_end|>"
    },
    {
        "ID": 264,
        "joke": "Taking calculus has made me want to become Prime Minister of a European country Then I can just throw money at problems instead of trying to integrate them.",
        "translation": "学习微积分让我萌生了成为欧洲某国总理的想法，这样我就可以把钱扔向问题，而不是试图去解决它们。<|im_end|>"
    },
    {
        "ID": 265,
        "joke": "My friend used my todo list to roll a blunt He's high on my list of priorities",
        "translation": "我的朋友用我的待办事项列表卷了一支烟，他在我优先事项列表中名列前茅。<|im_end|>"
    },
    {
        "ID": 266,
        "joke": "From now on when skinny girls say they're fat I'm just gonna be like, \"Yup\" & walk away.",
        "translation": "从现在起，当瘦女孩说自己胖的时候，我就点点头然后走开。<|im_end|>"
    },
    {
        "ID": 267,
        "joke": "What did the homeless person say to the gay job interviewer when asked for his address? No home-o.",
        "translation": "无家可归的人在接受同性恋面试官询问地址时说了什么？无家-。<|im_end|>"
    },
    {
        "ID": 268,
        "joke": "How many people with dementia does it take to change a lightbulb? To get to the other side.",
        "translation": "多少有认知障碍的人需要一起才能换一个灯泡？才能到达另一边。<|im_end|>"
    },
    {
        "ID": 269,
        "joke": "butts are truly the final frontier. to think we know more about SPACE than we do about the human butt. two fleshy mounds of mystery & wonder",
        "translation": "屁屁真是最后的边疆。想想看，我们对太空的了解比对人类屁屁的了解还要多。两个充满神秘与奇迹的肉堆。<|im_end|>"
    },
    {
        "ID": 270,
        "joke": "I keep getting the urge to purchase a big white bear from the artic... ...Doc says I might have \"Buy Polar\" disorder! EDIT: arctic*",
        "translation": "我一直有种冲动想要购买一只来自北极的大白熊……医生说我可能有“购买北极熊”障碍！编辑：应该是“南极”*<|im_end|>"
    },
    {
        "ID": 271,
        "joke": "How do you get a gay man to fuck a woman? Shit in her cunt.",
        "translation": "如何让一个同性恋男人和女人发生性关系？就是把屎拉到她的阴道里。<|im_end|>"
    },
    {
        "ID": 272,
        "joke": "I want to start a coffee shop that only plays ambient/electronic music... and call it Brian Beano.",
        "translation": "我想开一家只播放环境音乐/电子音乐的咖啡馆……并把它叫做Brian Beano。<|im_end|>"
    },
    {
        "ID": 273,
        "joke": "I like my girlfriend's new glow-in-the-dark braces... ...her smile really lights up the room now.",
        "translation": "我喜欢我女朋友新买的夜光牙套……她的笑容现在真的让整个房间都亮了起来。<|im_end|>"
    },
    {
        "ID": 274,
        "joke": "Mom writes to her son in Poland's army: \"Dear Son, I am writing this letter ever so slowly..... ....because I know you cannot read fast\"",
        "translation": "妈妈写信给在波兰军队的儿子：“亲爱的儿子，我写这封信写得非常慢……因为我知道你读得不快。”<|im_end|>"
    },
    {
        "ID": 275,
        "joke": "Did you hear about the calendar thief? He got 12 months; they say his days are numbered!",
        "translation": "你听说过日历小偷吗？他被判处12个月的监禁；他们说他的日子屈指可数！<|im_end|>"
    },
    {
        "ID": 276,
        "joke": "I hate how the losers of every election maintain such a high view of themselves... They're conceded",
        "translation": "我讨厌每次选举中失败者如此高估自己……他们已经认输了。<|im_end|>"
    },
    {
        "ID": 277,
        "joke": "I didn't see mommy kiss Santa, but my sister saw her kiss the mailman, which explains why I'm the only one with brown eyes in the family",
        "translation": "我没有看到妈妈亲圣诞老人，但我姐姐看到了她亲邮差，这就解释了为什么我是家里唯一一个棕色眼睛的人。<|im_end|>"
    },
    {
        "ID": 278,
        "joke": "Why did the vampire attack the clown? He wanted the circus to be in his blood.",
        "translation": "吸血鬼为什么袭击小丑？因为他想要让马戏团在他的血液中上演。<|im_end|>"
    },
    {
        "ID": 279,
        "joke": "How do I know when your sister's on her period..... Your dad's dick taste like blood",
        "translation": "我怎么知道你妹妹来月经了……你爸爸的丁丁尝起来像血<|im_end|>"
    },
    {
        "ID": 280,
        "joke": "What do you call going Doctor to Doctor... What do you call going Doctor to Doctor to figure out what your inflammatory bowel disease is called? A Game of Crohn's.",
        "translation": "你叫去看医生，去看医生，去弄清楚你的炎症性肠病叫什么？叫做“克罗恩病之战”。<|im_end|>"
    },
    {
        "ID": 281,
        "joke": "What's the difference between a pizza and a black man? The pizza can feed a family of 4.",
        "translation": "披萨和黑人有什么区别？披萨可以养活一个四口之家。<|im_end|>"
    },
    {
        "ID": 282,
        "joke": "If you hear the words \"oh yeah, suck it\" coming from my bedroom, it's probably just me vacuuming.",
        "translation": "如果你听到从我卧室传来“哦对，吸它”的声音，那 probably 就是我正在吸尘。<|im_end|>"
    },
    {
        "ID": 283,
        "joke": "A photon walks into a hotel The bell boy walks up and asks, \"Do you have any luggage?\". \"No,\" says the photon, \"I'm traveling light.\"",
        "translation": "一个光子走进一家酒店，门童走过来问：“你有行李吗？”光子回答说：“没有，我轻装上阵。”<|im_end|>"
    },
    {
        "ID": 284,
        "joke": "People always complain that I'm \"out there.\" [On the phone. To the cops. While I'm sitting in their birdbath.]",
        "translation": "人们总是抱怨我“离谱”。[在打电话。向警察报案。当我坐在他们的浴缸里。]<|im_end|>"
    },
    {
        "ID": 285,
        "joke": "*job interview* Why do you want to be a psychiatrist? *pictures clients acting like chickens after I click my fingers* I want to help people",
        "translation": "*面试* 你为什么想成为一名精神科医生？*我在点击手指后，看到客户们像鸡一样行动* 我想帮助人们<|im_end|>"
    },
    {
        "ID": 286,
        "joke": "\"911, what's your emergency?\" Me: A cute guy at the laundromat walked past me while I was folding my period underwear.",
        "translation": "911, 你有什么紧急情况？我：我在折叠月经内裤时，洗衣店里有个帅小伙从我身边走过。<|im_end|>"
    },
    {
        "ID": 287,
        "joke": "Dog's Facebook status: Tried to save the master from the vacuum cleaner today... He just yelled at me.",
        "translation": "狗的Facebook状态：今天尝试救主人免受吸尘器的伤害……他只是对我大喊。<|im_end|>"
    },
    {
        "ID": 288,
        "joke": "What is the term for a group of Canadians? Is it \"an apology\"? \"Oh look, there goes an apology of Canadians\"",
        "translation": "一群加拿大的人被称为“一个道歉”吗？“哦，看，那里走来一个加拿大的道歉。”<|im_end|>"
    },
    {
        "ID": 289,
        "joke": "Trump wants to appoint Ben Carson to the Department of Education, but I think he would do better in the FDA He can feed everyone with all of the grain in those pyramids.",
        "translation": "特朗普想任命本·卡森为教育部部长，但我认为他更适合担任FDA局长，因为他可以用那些金字塔里的谷物喂饱所有人。<|im_end|>"
    },
    {
        "ID": 290,
        "joke": "Putting a woman on a $10 makes sense . . . . . . no one really wants a 1 or a 5. (As heard on Wait, Wait, Don't Tell Me)",
        "translation": "把女人印在10元钞票上很有道理……没有人真的想要1元或5元。（来自《等等，别告诉我》）<|im_end|>"
    },
    {
        "ID": 291,
        "joke": "I always check my smoke alarms to make sure they're working. I call it \"cooking\"",
        "translation": "我总是检查烟雾报警器确保它们正常工作。我称之为“烹饪”。<|im_end|>"
    },
    {
        "ID": 292,
        "joke": "[wife looking at pictures of my dead body with police] \"why isn't he wearing a shirt\" we believe he removed it when he challenged the coyote",
        "translation": "妻子看着我尸体的照片，对警察说：“他为什么不穿衬衫？”我们相信他在挑战 coyote 时自己脱掉了。<|im_end|>"
    },
    {
        "ID": 293,
        "joke": "I just found out I am a hipster Because I started using #NotMyPresident 8 years ago.",
        "translation": "我只是发现自己是个潮人，因为我8年前就开始使用#NotMyPresident了。<|im_end|>"
    },
    {
        "ID": 294,
        "joke": "What's the difference between a computer and a woman? A computer only has to have information punched into it once.",
        "translation": "计算机和女人有什么区别？计算机只需要将信息输入一次。<|im_end|>"
    },
    {
        "ID": 295,
        "joke": "How to meet a girl: 1) Walk into a bar. 2) Shout \"Heroes in a half shell.\" 3) When a girl yells back \"Turtle Power,\" marry her.",
        "translation": "如何遇到女孩：1) 走进一家酒吧。2) 大喊一声“海龟战士。”3) 当一个女孩回应“龟速之力”时，就娶了她。<|im_end|>"
    },
    {
        "ID": 296,
        "joke": "What's the sharpest thing in the word? A fart. It goes right through your pants and doesn't leave a hole.",
        "translation": "世界上最尖锐的东西是什么？是一阵屁。它直接穿过你的裤子，却不留下任何洞。<|im_end|>"
    },
    {
        "ID": 297,
        "joke": "*calls into work* \"yo boss i'm real sick\" \"you don't sound sick...\" \"ya, just got a new tribal tat & heelys\" \"wow u do sound hella sick\"",
        "translation": "*给老板打电话*：“喂，老板，我 really 很不舒服。”“你听起来不像是生病了……”“是的，刚纹了新的部落纹身和穿上了heelys。”“哇，你听起来真的病得很重。”<|im_end|>"
    },
    {
        "ID": 298,
        "joke": "I'm not saying that girl's a slut... But she has touched more wieners than Heinz ketchup.",
        "translation": "我不是说那个女孩是荡妇……但她摸过的香肠比亨茨凯撒斯还要多。<|im_end|>"
    },
    {
        "ID": 299,
        "joke": "how are a silver medalist and a priest alike They both came in a little behind",
        "translation": "银牌得主和牧师有什么相似之处？他们都稍微落后了一点。<|im_end|>"
    },
    {
        "ID": 300,
        "joke": "Saw a homeless guy babbling about conspiracy theories that doesn't really make sense... You could say it was a vague rant.",
        "translation": "看到一个无家可归的人在胡言乱语一些不着边际的阴谋论，可以说那是一通模糊的抱怨。<|im_end|>"
    },
    {
        "ID": 301,
        "joke": "Blessed are those who are cracked, for they are the ones who let in the light!",
        "translation": "有裂缝的人是有福的，因为他们让光线照了进来！<|im_end|>"
    },
    {
        "ID": 302,
        "joke": "Remember before Amazon reviews when you could just buy a toothbrush without 6 hours of research?",
        "translation": "记得在亚马逊评论出现之前，你只需要花几分钟就能买个牙刷，不用花6个小时做研究的日子吗？<|im_end|>"
    },
    {
        "ID": 303,
        "joke": "Don't judge me because I like 80's music. Judge me because I had a late term abortion because a baby would ruin my holiday plans.",
        "translation": "不要因为我喜欢80年代的音乐就评判我。评判我是因为我因为宝宝会破坏我的假期计划而进行了晚期堕胎。<|im_end|>"
    },
    {
        "ID": 304,
        "joke": "When someone uses the bathroom and asks about the wine cork floating in the toilet is why I don't invite people to my house.",
        "translation": "有人在上厕所时问起马桶里漂浮的酒塞，这正是我不再邀请人们来我家的原因。<|im_end|>"
    },
    {
        "ID": 305,
        "joke": "An infectious disease enters a bar... the bartender says,\"we dont serve your kind here\". The disease replies, \"well you're not a very good host!\"",
        "translation": "一个传染病走进了一家酒吧……酒保说：“这里不招待你们这种人。”传染病回应道：“那你可不算个好东道主！”<|im_end|>"
    },
    {
        "ID": 306,
        "joke": "If four out of five people suffer from radiation poisoning... Does that mean the fifth one enjoys it?",
        "translation": "如果五个人中有四个人遭受辐射中毒……那么第五个人是不是喜欢这样？<|im_end|>"
    },
    {
        "ID": 307,
        "joke": "Having the option to erase and re-record after having to leave a voicemail is one of my favorite things about life.",
        "translation": "能够在留言后选择删除并重新录制，是我生活中最喜欢的功能之一。<|im_end|>"
    },
    {
        "ID": 308,
        "joke": "Well it's like my dad always told me \"When life gives ya lemons\" Chances are you're in the fruit aisle.",
        "translation": "就像我爸爸总是对我说的：“生活给你柠檬” 很可能你是在水果区。<|im_end|>"
    },
    {
        "ID": 309,
        "joke": "I just saw the Assassins Creed Movie Trailer... I did not expect The Spanish Inquisition.",
        "translation": "我看了一下《刺客信条》的电影预告片……我没想到会有西班牙围攻。<|im_end|>"
    },
    {
        "ID": 310,
        "joke": "Why do Canadians do it doggy style? So they can both watch the hockey game.",
        "translation": "为什么加拿大人喜欢狗式做爱？因为他们可以一边做爱一边看冰球比赛。<|im_end|>"
    },
    {
        "ID": 311,
        "joke": "Dad and son A son asks his father \"Why does my bum hurt\" while the father replies \"Because I love you son\"",
        "translation": "儿子问父亲：“为什么我的屁股疼”，父亲回答：“因为我爱你，儿子”。<|im_end|>"
    },
    {
        "ID": 312,
        "joke": "A programmer began to cuss Because getting to sleep was a fuss. When laying in her bed Looping round in her head Was: while (!asleep()): sheep++;",
        "translation": "一个程序员开始骂人，因为她入睡变得很麻烦。躺在床上时，她的脑海里不断循环着：while (!asleep()) { sheep++; }<|im_end|>"
    },
    {
        "ID": 313,
        "joke": "I see you've got your bill for using the Internet Yes and my dad's really going to get the hump!",
        "translation": "我看到你收到了上网的账单，而且你爸爸真的要大发雷霆了！<|im_end|>"
    },
    {
        "ID": 314,
        "joke": "When do you kick a midget in the balls? When he's standing next to your girlfriend saying her hair smells nice",
        "translation": "什么时候踢矮子的蛋？当他在你女朋友旁边说她头发闻起来很好闻的时候<|im_end|>"
    },
    {
        "ID": 315,
        "joke": "Why don't you want your nose to be 12 inches long? because then it would be a foot!",
        "translation": "为什么你不想让你的鼻子长12英寸？因为那样它就变成一英尺了！<|im_end|>"
    },
    {
        "ID": 316,
        "joke": "Keep in mind that \"The Cat in the Hat\" is a lesson to your kids on how to throw a house party when you're gone...",
        "translation": "记住，《猫在帽子里》是教你孩子如何在你不在的时候举办一场家庭聚会的课程……<|im_end|>"
    },
    {
        "ID": 317,
        "joke": "When someone tells you to \"get a Life,\" just take theirs. They'll be happy you took their advice, and you'll be happy they're dead.",
        "translation": "当有人告诉你“去活出自己的人生”，你就拿走他们的生命。他们会因为你采纳了他们的建议而高兴，而你会因为他们的死亡而感到高兴。<|im_end|>"
    },
    {
        "ID": 318,
        "joke": "Day One, living in one of those tiny houses: \"Well, isn't this quaint?\" Day Two: Murder",
        "translation": "第一天，住在那种小房子里：“嗯，这多有情调啊？”第二天：谋杀<|im_end|>"
    },
    {
        "ID": 319,
        "joke": "How to get a job... Interviewer: \"What's your biggest weakness?\" Interviewee: \"I never learn from my mistakes\" Interviewer: \"Oh, why's that?\" Interviewee: \"I never make any\"",
        "translation": "如何获得工作……面试官：“你的最大弱点是什么？”应聘者：“我从不从错误中吸取教训。”面试官：“哦，为什么呢？”应聘者：“因为我从不犯错。”<|im_end|>"
    },
    {
        "ID": 320,
        "joke": "I showed my son a floppy disk today... ...he said: 'oh cool, you 3D-printed a save icon'",
        "translation": "我今天给我儿子看了一个软盘……他说：“哦酷，你用3D打印了一个保存图标”<|im_end|>"
    },
    {
        "ID": 321,
        "joke": "Difference between priest and acne? What is the difference between a Catholic priest and acne? Acne waits until puberty to come on a kid's face.",
        "translation": "神父和青春痘有什么区别？神父和青春痘的区别是什么？青春痘要等到青春期才出现在孩子的脸上。<|im_end|>"
    },
    {
        "ID": 322,
        "joke": "Them: If you were stranded on a desert island with any two people, living or dead, who would they be? Me: Can they both be dead?",
        "translation": "他们：如果你被困在荒岛上，只能和任何两个，无论是生者还是死者一起，你会选择谁？我：他们俩都可以是死者吗？<|im_end|>"
    },
    {
        "ID": 323,
        "joke": "T Rex isnt so scary if you imagine a bunch of baby T Rexes watching Barney just giggling and rolling around on the ground playing with keys.",
        "translation": "霸王龙其实不那么可怕，如果你想象一群小霸王龙在看着巴尼傻笑并在地上玩耍，拿着钥匙乱翻。<|im_end|>"
    },
    {
        "ID": 324,
        "joke": "Since Michael Jackson's death hundreds of children have gathered at the gates of Neverland. Police have said that they will let them out once they find a locksmith. - http://ww.key-n-lock.com",
        "translation": "自从迈克尔·杰克逊去世以来，成百上千的孩子聚集在梦幻岛的门口。警方表示，他们会等到找到锁匠后再放他们出去。- http://ww.key-n-lock.com<|im_end|>"
    },
    {
        "ID": 325,
        "joke": "Why do gay men always have candles near their asses? So the gerbils can find their way out.",
        "translation": "为什么同性恋男人总是把蜡烛放在屁股旁边？这样仓鼠才能找到出路。<|im_end|>"
    },
    {
        "ID": 326,
        "joke": "What do Jesus and your mom have in common? They both got nailed all night.",
        "translation": "耶稣和你妈妈有什么共同点？他们俩都被钉了一整夜。<|im_end|>"
    },
    {
        "ID": 327,
        "joke": "How does J.G. Wentworth tell you that he's hungry? \"It's my tummy, and I feed it NOW!\"",
        "translation": "J.G.温特沃斯是如何告诉你他饿了的？“是我的肚子，现在就喂它！”<|im_end|>"
    },
    {
        "ID": 328,
        "joke": "I can see you're upset. Maybe you should post more about it on Facebook. That should eliminate any more drama.",
        "translation": "我能看出你很不高兴。也许你应该在Facebook上多发一些关于这件事的内容。这样可以消除更多的 drama。<|im_end|>"
    },
    {
        "ID": 329,
        "joke": "I want a girlfriend with OCD, that way whenever I want to go home I can just say \"Are you sure you checked the stove before we left?\"",
        "translation": "我想找一个有强迫症的女朋友，这样每次我想回家时，就可以问她：“你确定离开前检查过炉子了吗？”<|im_end|>"
    },
    {
        "ID": 330,
        "joke": "woke up just in time to push my cat off the bed before he threw up. today is going to be magical.",
        "translation": "刚起床，及时把猫从床上推开，以免它呕吐。今天将会是神奇的一天。<|im_end|>"
    },
    {
        "ID": 331,
        "joke": "Just stirred my coffee with a fork if any of you guys are looking for a new bad boy to join your crew.",
        "translation": "我只是用叉子搅拌了我的咖啡，如果你中的有人在寻找一个新的坏男孩加入你们的团队。<|im_end|>"
    },
    {
        "ID": 332,
        "joke": "I was licking this girl all over her face right up until she explained to me what doggy style was.",
        "translation": "我在她脸上舔了好久，直到她告诉我什么是“狗式”为止。<|im_end|>"
    },
    {
        "ID": 333,
        "joke": "If your tweet gets stolen and posted on Facebook... It's your own fault for not making it offensive enough!",
        "translation": "如果你的推特被偷并在Facebook上发布... 这都是因为你不够恶毒！<|im_end|>"
    },
    {
        "ID": 334,
        "joke": "To all the girls that say Gentlemen don't exist anymore: They do exist but Gentlemen are attracted to Ladies. Not s?uts.  Sorry.",
        "translation": "对所有声称绅士已经不存在的女孩们：绅士确实存在，但他们被女士吸引，而不是西装。对不起。<|im_end|>"
    },
    {
        "ID": 335,
        "joke": "\"Sugar\" is the only word in the English language where \"su-\" makes a \"sh\" sound. At least, I'm pretty sure...",
        "translation": "“糖”是英语中唯一一个“su-”发音为“sh”音的单词，至少我是这么认为的。<|im_end|>"
    },
    {
        "ID": 336,
        "joke": "A horse walks into the bar Several people left because they realised the possible dangers of that situation.",
        "translation": "一匹马走进了酒吧，因为意识到那种情况的潜在危险，好几个人离开了。<|im_end|>"
    },
    {
        "ID": 337,
        "joke": "I've decided to make an all-natural shampoo made from roots found in Africa. I'll call it Ethnic Cleansing.",
        "translation": "我已经决定制作一款全天然洗发水，原料来自非洲的植物根部。我打算叫它“种族清洗”。<|im_end|>"
    },
    {
        "ID": 338,
        "joke": "A Midget Walked Past Me On The Sidewalk Today Wearing A Shirt That Said \"I Hate Black People\" ...I thought to myself \"Well damn- thats a little racist.",
        "translation": "一个侏儒今天在我旁边的人行道上走过，穿着一件写着“我讨厌黑人”的T恤……我心里想，“天哪，这有点种族主义。”<|im_end|>"
    },
    {
        "ID": 339,
        "joke": "Nsfw Whats the difference between a Catholic priest and a zit? The zit waits untill you're 12 to come onto your face.",
        "translation": "不可安全的内容：天主教神父和青春痘有什么区别？青春痘要等到你12岁才出现在你的脸上。<|im_end|>"
    },
    {
        "ID": 340,
        "joke": "True: If you don't eat a whole basket of tortilla chips before your entree arrives in a Mexican restaurant it means you don't love your mom.",
        "translation": "如果你在墨西哥餐厅里正餐到来之前不吃一整篮玉米片，那就意味着你不喜欢你妈妈。<|im_end|>"
    },
    {
        "ID": 341,
        "joke": "A clown at the circus got tomato thrown at him from the audience, he turns and says HAY, THATS NOT FUNNY",
        "translation": "马戏团里的小丑被观众扔了一个西红柿，他转过身说：“嘿，这不搞笑。”<|im_end|>"
    },
    {
        "ID": 342,
        "joke": "Doctors have confirmed that masturbation is life threatening Many men have died after having a stroke",
        "translation": "医生已经证实自慰对生命构成威胁，许多男性在中风后丧生。<|im_end|>"
    },
    {
        "ID": 343,
        "joke": "The Presidential Debate We don't know if Hillary is telling the truth, and we're hoping Trump isn't",
        "translation": "总统辩论：我们不知道希拉里是否在说实话，但我们希望特朗普不是<|im_end|>"
    },
    {
        "ID": 344,
        "joke": "Q. How did the blonde die  ice-fishing? A. She was run over by the zambonis machine.",
        "translation": "为什么金发女郎在冰钓时死了？因为她被冰上清洁机撞倒了。<|im_end|>"
    },
    {
        "ID": 345,
        "joke": "I really like those Black and White movies where no one speaks Inter racial porn.",
        "translation": "我真的喜欢那些黑白电影，里面没有人说“种族色情”。（注：这里的“Inter racial porn”在中文中可能需要根据具体语境进行翻译，这里翻译为“种族色情”是为了保留原文的敏感性，但请注意，这可能是一个不恰当的翻译，具体翻译应根据实际情况调整。）<|im_end|>"
    },
    {
        "ID": 346,
        "joke": "hey girl are you my ceiling fan because i'm pretty hot but also too lazy to get up and turn you on",
        "translation": "嘿，姑娘，你是我的吊扇吗？因为我真的很热，但又懒得起来把你打开。<|im_end|>"
    },
    {
        "ID": 347,
        "joke": "Alien 1: What are the Humans doing? Alien 2: Celebrating the existence of their mothers. Alien 1: I ate my mother. Alien 2: As did I.",
        "translation": "外星人1：人类在干什么？外星人2：庆祝她们母亲的存在。外星人1：我吃掉了我的母亲。外星人2：我也是。<|im_end|>"
    },
    {
        "ID": 348,
        "joke": "What Did the Upvote whore say to the Redditor? I'll suck yo dick for a Upvote",
        "translation": "点赞婊子对 redditor 说：我可以用点赞给你口炮<|im_end|>"
    },
    {
        "ID": 349,
        "joke": "I'm never more ruthless than when deciding who to wish a happy birthday to on Facebook and who to ignore.",
        "translation": "我从不比在决定在Facebook上向谁送上生日祝福或选择无视谁时更无情。<|im_end|>"
    },
    {
        "ID": 350,
        "joke": "\"I'll be a dentist. Then they'll love me.\" \"We're terrified of dentists.\" \"I'll kill a lion!\" \"It was a beloved lion with a name.\" \"Dammit.\"",
        "translation": "我会成为一名牙医，然后他们就会爱我。\"我们害怕牙医。\" \"我要杀死一只狮子！\" \"那是一只受人喜爱并有名字的狮子。\" \"该死的。\"<|im_end|>"
    },
    {
        "ID": 351,
        "joke": "Just because I'm Irish doesn't mean I am always drunk. It means I always want to be.",
        "translation": "正因为我是爱尔兰人，并不意味着我总是醉酒。那意味着我总是渴望醉酒。<|im_end|>"
    },
    {
        "ID": 352,
        "joke": "Just once I'd like to wake up as eager to start the day as my p*nis is.",
        "translation": "但愿有一天我能像我的**一样对新的一天充满热情。<|im_end|>"
    },
    {
        "ID": 353,
        "joke": "My friend asked me... My friend asked me if there was a colored printer in the library I said wtf man it's 2016 you can use whatever printer you want",
        "translation": "我的朋友问我……我的朋友问我图书馆里有没有彩色打印机，我说卧槽，现在是2016年，你想用哪个打印机就用哪个。<|im_end|>"
    },
    {
        "ID": 354,
        "joke": "Subway's Jared got famous for fitting into smaller pants... ...now he is known for hoping to get into really small pants.",
        "translation": "Subway的Jared因穿上更紧身的裤子而走红……现在他闻名于希望穿上非常紧身的裤子。<|im_end|>"
    },
    {
        "ID": 355,
        "joke": "Kissing a sleeping woman in an animated Disney movie, romantic.....but do it on a bus and the judge doesn't agree.",
        "translation": "在迪士尼动画电影中亲吻一位睡着的女性，浪漫……但在公交车上这么做，法官不同意。<|im_end|>"
    },
    {
        "ID": 356,
        "joke": "What did Asian Jesus say before he was crucified? (OC) YORO (You only resurrect once)",
        "translation": "被钉十字架前，亚洲耶稣说了什么？（OC）你只能复活一次<|im_end|>"
    },
    {
        "ID": 357,
        "joke": "You can consider yourself lucky in life, if the cognac you drink is older than the woman that you're sleeping with.",
        "translation": "你可以说自己是幸运的，如果你喝的科涅克白兰地比你正在交往的女人还要年长。<|im_end|>"
    },
    {
        "ID": 358,
        "joke": "What's the difference between a dirty bus stop and a voluptuous lobster? One's a crusty bus station and the other's a busty crustacean. :D edit: funnier when said aloud",
        "translation": "脏公交站和丰腴的龙虾有什么区别？一个是油腻的公交站，另一个是丰满的甲壳类动物。：D 编辑：大声说出来更有趣<|im_end|>"
    },
    {
        "ID": 359,
        "joke": "I just got a job helping a one arm typist do capital letters... Its shift work.",
        "translation": "我刚刚找到了一份工作，帮助一位单臂打字员打大写字母……这是轮班工作。<|im_end|>"
    },
    {
        "ID": 360,
        "joke": "What do you call a group of chickens dressed up like crows? A murder most fowl. (I'll see myself out...)",
        "translation": "一群装扮成乌鸦的鸡叫什么？乌鸦群，真是禽兽。 （我自己出去了……）<|im_end|>"
    },
    {
        "ID": 361,
        "joke": "Italians and Spaniards are so used to Catholic child abuse... ... That they call the Pope daddy",
        "translation": "意大利人和西班牙人对天主教的儿童虐待已经习以为常，以至于他们称呼教皇为“爸爸”。<|im_end|>"
    },
    {
        "ID": 362,
        "joke": "How many software engineers does it take to change a light bulb? None. It's a hardware problem.",
        "translation": "多少软件工程师需要来换灯泡？不需要，那是硬件问题。<|im_end|>"
    },
    {
        "ID": 363,
        "joke": "I love how fresh & clean my bathroom smells after I've killed a spider with a full bottle of windex",
        "translation": "我喜欢在用一整瓶威猛先生消灭蜘蛛后，浴室里闻起来清新又干净的感觉。<|im_end|>"
    },
    {
        "ID": 364,
        "joke": "Guest: Why did you offer me a piece of candy? Hotel Clerk: You said you wanted the best suite in the hotel.",
        "translation": "客人：你为什么给我一块糖果？酒店职员：你说你想要酒店里最好的套房。<|im_end|>"
    },
    {
        "ID": 365,
        "joke": "Daughter: Daddy, why do I have to go to bed so early? Me: Because we have had enough of you for today",
        "translation": "女儿：爸爸，为什么我晚上要这么早就睡觉？  爸爸：因为今天你已经让我受够了。<|im_end|>"
    },
    {
        "ID": 366,
        "joke": "Everyone in my class is arguing about science, And I'm just sitting here, maths debating.",
        "translation": "在我们班上，每个人都争论着科学问题，而我则坐在那里，用数学来辩论。<|im_end|>"
    },
    {
        "ID": 367,
        "joke": "A policeman sees two boys, one with batteries, the other with fireworks He charges the first boy and lets the other off.",
        "translation": "一个警察看到两个男孩，一个拿着电池，另一个拿着烟花。警察逮捕了第一个男孩，放过了第二个。<|im_end|>"
    },
    {
        "ID": 368,
        "joke": "My daughter asked me how much longer until she can be a grown up and I said, \"no.\"",
        "translation": "我的女儿问我还要多久才能长大，我说“不行。”<|im_end|>"
    },
    {
        "ID": 369,
        "joke": "I saw a sausage fly by my window I must be going insane it was actually a bird. I think I've taken a Tern for the Wurst",
        "translation": "我看见一只香肠从窗户旁边飞过，我一定是疯了，那其实是只鸟。我想我已经“鸟”关“肉”了。<|im_end|>"
    },
    {
        "ID": 370,
        "joke": "If Kevin Bacon never said \"want some bacon with your eggs\" to a lonely chick in a bar, life just doesn't make sense anymore.",
        "translation": "如果凯文·班农从未对酒吧里的一位孤独女孩说“要不要来点培根配鸡蛋”，那么生活就变得毫无意义了。<|im_end|>"
    },
    {
        "ID": 371,
        "joke": "\"Hey, wanna hangout?\" \"Later.\" \"Now?\" \"No, later\" \"How about now?\" \"Jesus christ.\" -if Adobe Updater was your friend",
        "translation": "嘿，想一起出去玩吗？“稍后。”“现在呢？”“不，稍后。”“那现在呢？”“耶稣基督。”——如果Adobe更新器是你朋友<|im_end|>"
    },
    {
        "ID": 372,
        "joke": "Follow your dreams. Unless you're a narcoleptic who wants to be a limo driver. That's dangerous, dude.",
        "translation": "追逐你的梦想吧。除非你是有睡眠瘫痪症却想成为一名豪华轿车司机的人。那可危险了，伙计。<|im_end|>"
    },
    {
        "ID": 373,
        "joke": "Republicans help the poor during the holidays by sending 50 one buck at a time to panhandlers on the  street.",
        "translation": "共和党人在节日期间通过一次给街上的乞丐一张一美元的钞票来帮助穷人。<|im_end|>"
    },
    {
        "ID": 374,
        "joke": "I can't tell if Michael Cera is actually an actor, or just an awkward guy who keeps wandering onto film sets and does his best to fit in.",
        "translation": "我不知道迈克尔·塞拉到底是演员，还是一个只是偶然出现在电影拍摄现场、尽力融入其中的尴尬大男孩。<|im_end|>"
    },
    {
        "ID": 375,
        "joke": "Learning to love yourself is important. Just don't let your wife catch you doing it.",
        "translation": "学会爱自己很重要。只是别让你妻子看到你在这样做。<|im_end|>"
    },
    {
        "ID": 376,
        "joke": "Me: My weight is up. I really hate winter. Him: Don't be discouraged. You'll bounce back in spring once you shave your legs.",
        "translation": "我：我的体重增加了，我真的讨厌冬天。他：别灰心，等春天来了，你剃了腿毛就会恢复的。<|im_end|>"
    },
    {
        "ID": 377,
        "joke": "Me texting friend: Hey! What's up? Buddy: *sends picture of ceiling* Me: I am so glad I didn't ask \"how's it hanging\"",
        "translation": "我给朋友发短信：嘿！最近怎么样？朋友：*发送了一张天花板的照片* 我：幸好我没有问“挂得怎么样”。<|im_end|>"
    },
    {
        "ID": 378,
        "joke": "I cheated a guy in poker so he burnt down my house. I guess you could say it was a conflagration",
        "translation": "我在扑克牌游戏中欺骗了一个家伙，结果他把我的房子烧了。这么说吧，这确实是一场大火。<|im_end|>"
    },
    {
        "ID": 379,
        "joke": "Two blonds are having a conversation. Two blonds are having a conversation when one says to the other \"I had sex with a brazilian last night\" The other blond replies \"WOW that's a lot of men\"",
        "translation": "两个金发女郎正在交谈。当其中一个对另一个说：“昨晚我和一个巴西人发生了关系。”另一个金发女郎回答说：“哇，那得多大的男人啊。”<|im_end|>"
    },
    {
        "ID": 380,
        "joke": "The nintendo 64 turned 18 last month Which means you can now legally blow the cartridges",
        "translation": "上个月任天堂64度过了它的18岁生日，这意味着现在你可以合法地吹气卡带了。<|im_end|>"
    },
    {
        "ID": 381,
        "joke": "Son: Are you eating pie for breakfast? Me (eating pie): No. Fruit casserole. Want some? Son: NO. I hate casserole. Me (whispers): I know...",
        "translation": "儿子：你早餐吃派吗？我（正在吃派）：不，是水果布丁。你要来一份吗？儿子：不，我讨厌布丁。我（小声说）：我知道……<|im_end|>"
    },
    {
        "ID": 382,
        "joke": "Before I lose my phone, end up naked, high, drunk and/or possibly arrested, I would like to wish you all a Happy Friday.",
        "translation": "在我不再丢手机、赤裸裸、嗑药、喝醉或可能被捕之前，我希望你们所有人都有一个快乐的星期五。<|im_end|>"
    },
    {
        "ID": 383,
        "joke": "My friend's a scientist and accidentally chilled his lab rat to absolute zero... At first the rat was just frozen, but he's 0K now.",
        "translation": "我的朋友是一名科学家，不小心将他的实验鼠冷却到了绝对零度……一开始这只老鼠只是被冻住了，但现在他“0K”了。<|im_end|>"
    },
    {
        "ID": 384,
        "joke": "A mushroom walks into a bar The bartender says: \"Get out of here! We don't serve your kind here.\" The mushroom says: \"Why not man? I really am a FunGi.\"",
        "translation": "一个蘑菇走进了一家酒吧，酒保说：“快出去！我们这里不招待你这种人。”蘑菇说：“为什么呀，哥们儿？我真的是一朵fungi。”<|im_end|>"
    },
    {
        "ID": 385,
        "joke": "Anyone got a 10 year old daughter I could introduce as mine? Stuck in an elaborate lie after putting my music on shuffle at a party.",
        "translation": "有人能介绍一个10岁的女儿给我当亲生的吗？因为我在派对上把音乐设成了随机播放，现在陷入了复杂的谎言中。<|im_end|>"
    },
    {
        "ID": 386,
        "joke": "They say love is worth more than money. But I'm pretty sure my landlord is gona want more than a hug.",
        "translation": "他们说爱比金钱更有价值。但我敢肯定，我的房东想要的不仅仅是一个拥抱。<|im_end|>"
    },
    {
        "ID": 387,
        "joke": "I heard that Being the one to circumcise elephants doesn't pay too well But the tips are huge!!",
        "translation": "听说给大象做包皮手术报酬不高，但小费超级丰厚！<|im_end|>"
    },
    {
        "ID": 388,
        "joke": "A Frenchman walks into a library and asks for a book on warfare. The librarian tells him he'll only lose it.",
        "translation": "一个法国人走进图书馆，要求借阅一本关于战争的书。图书管理员告诉他这本书只会让他失去它。<|im_end|>"
    },
    {
        "ID": 389,
        "joke": "I held up a fist for a CW to bump and she kissed my ring. I am now drunk on power and no one is allowed to make eye contact.",
        "translation": "我举起拳头示意一个CW来推波助澜，她却吻了我的戒指。我现在醉心于权力，没有人被允许与我眼神交流。<|im_end|>"
    },
    {
        "ID": 390,
        "joke": "you knew the backstreet boys were actually friends because when the one boy asks if hes \"sexual\" the rest of the boys all agree that he is",
        "translation": "你之所以知道《后街男孩》其实都是朋友，是因为当一个男孩问自己是否“有性吸引力”时，其他男孩都纷纷表示赞同。<|im_end|>"
    },
    {
        "ID": 391,
        "joke": "A sadist and a masochist meet The masochist starts pleading, \"Hit me! Please hit me!\" The sadist looks at him, smiles, and calmly replies, \"No.\"",
        "translation": "施虐者和受虐者相遇。受虐者开始哀求：“打我！请打我！”施虐者看着他，微笑着平静地回答：“不。”<|im_end|>"
    },
    {
        "ID": 392,
        "joke": "Got disoriented and walked into the wrong classroom. Didn't want to look stupid so I just went ahead and switched majors.",
        "translation": "迷路了，走进了 wrong classroom。不想显得愚蠢，干脆就转了专业。<|im_end|>"
    },
    {
        "ID": 393,
        "joke": "My wife urged me to be more experimental in the bedroom, but I guess she wasn't expecting I'd be dissecting so many white mice.",
        "translation": "我的妻子敦促我在卧室里更加实验性，但她大概没想到我会解剖这么多小白鼠。<|im_end|>"
    },
    {
        "ID": 394,
        "joke": "ME: Is this Babies R Us CASHIER: Yes ME: No babies work here C: I know ME: It should be called Babies Were US C: ... ME: Get me your manager",
        "translation": "顾客：这是婴儿用品店吗？收银员：是的。顾客：这里没有在工作的婴儿。收银员：我知道。顾客：它应该叫婴儿已来过这里。收银员：……顾客：给我找经理。<|im_end|>"
    },
    {
        "ID": 395,
        "joke": "A girl grabbed my cock and said, \"Wow! Your dick wouldn't make a very good clock.\" \"Why?\" I asked, intrigued. \"Because I'd struggle to get a second hand on it,\" she replied.",
        "translation": "一个女孩摸了我的阴茎，说：“哇！你的阳具当钟表也不行。”“为什么？”我好奇地问。“因为我要费劲才能在上面装个秒针。”她回答道。<|im_end|>"
    },
    {
        "ID": 396,
        "joke": "A man goes to the vet about his dog's fleas. The vet says: 'I'm sorry, I'll have to put this dog down.' The man is incredulous and asks why. The vet says: 'Because he's far too heavy.'",
        "translation": "一个男人带他的狗去看兽医，因为狗有跳蚤。兽医说：“对不起，我必须安乐死这只狗。”男人难以置信地问为什么。兽医说：“因为这只狗太重了。”<|im_end|>"
    },
    {
        "ID": 397,
        "joke": "listen, officer - t h e o r e t i c a l l y - would I still get a carpool lane ticket if I have a body in the trunk",
        "translation": "听着，警官——理论上——如果车里有尸体，我还能拿到拼车车道的罚单吗<|im_end|>"
    },
    {
        "ID": 398,
        "joke": "Why do seagulls live by the sea? If they lived by the bay they'd be bagels.",
        "translation": "为什么海鸥住在海边？如果它们住在海湾，它们就是贝果。<|im_end|>"
    },
    {
        "ID": 399,
        "joke": "When I lived on a houseboat I was seeing the girl next door, but eventually we drifted apart.",
        "translation": "当我住在一艘屋船上时，我正在和隔壁的女孩交往，但最终我们分道扬镳了。<|im_end|>"
    },
    {
        "ID": 400,
        "joke": "My grandma got her bathroom redone with this sparkly gold-specked tile and she just called it her \"golden shower\" so goodnight.",
        "translation": "我的奶奶把浴室重新装修了一下，用了这种带有金色斑点的瓷砖，她自己还美其名曰“金色沐浴”，所以晚安。<|im_end|>"
    },
    {
        "ID": 401,
        "joke": "Why does it take pirates so long to learn the alphabet? Because they could spend years at C.",
        "translation": "为什么海盗学字母表要花那么长时间？因为他们可能在“C”上花了好几年。<|im_end|>"
    },
    {
        "ID": 402,
        "joke": "There's a 100% chance the Republicans will discuss Starbucks cups in a debate tonight, so remember that when they ask how they lost in 2016.",
        "translation": "今晚共和党在辩论中讨论星巴克杯子的可能性是100%，所以当他们被问及2016年是如何失败的时，请记住这一点。<|im_end|>"
    },
    {
        "ID": 403,
        "joke": "A man purchases a kitten, which he's having trouble house breaking. What does his friend say when he comes to visit? Your house is quite the cat-ass-trophy.",
        "translation": "一个男人买了一只小猫，但他很难训练它上厕所。当他的朋友来拜访时，朋友说：“你的房子真是个猫屎奖杯。”<|im_end|>"
    },
    {
        "ID": 404,
        "joke": "There are two types of people in life... Those who think there are two types of people in life and the rest.",
        "translation": "生活中有两种人……一种是认为生活中有两种人的人，另一种是其余的人。<|im_end|>"
    },
    {
        "ID": 405,
        "joke": "My best friend and I were comparing our penises... for who has the biggest. It ended in a tie.",
        "translation": "我和我最好的朋友在比较我们的阴茎，看谁的大。结果是平局。<|im_end|>"
    },
    {
        "ID": 406,
        "joke": "If Trump wins, I'm leaving the country, if Clinton wins I'm leaving the country Not a political post, I just love to travel",
        "translation": "如果特朗普赢了，我就离开这个国家，如果希拉里赢了，我也离开这个国家。这不是一个政治帖子，我只是喜欢旅行。<|im_end|>"
    },
    {
        "ID": 407,
        "joke": "Why did the Storm Trooper decide to buy an Iphone? Because he couldn't find the Droid he was looking for.",
        "translation": "为什么那个突击队员决定买一部iPhone？因为他找不到自己想要的Droid。<|im_end|>"
    },
    {
        "ID": 408,
        "joke": "What is the difference between a drug dealer and a hooker? A hooker can wash her crack and sell it again.",
        "translation": "妓女和毒品贩子的区别是什么？妓女可以把她的冰毒洗洗再卖。<|im_end|>"
    },
    {
        "ID": 409,
        "joke": "When I say I'm gonna take a nap, it means I'm gonna go on my computer for three hours.",
        "translation": "当我说我要去小睡一会儿时，这意味着我要在电脑上待三个小时。<|im_end|>"
    },
    {
        "ID": 410,
        "joke": "I love watching two girls meet each other. It's easily the most fake thing I have ever seen.",
        "translation": "我喜欢看两个女孩见面，这是我见过的最假的东西。<|im_end|>"
    },
    {
        "ID": 411,
        "joke": "Pokemon Go has really improved my life... I used to always get in trouble for playing with my balls outside.",
        "translation": "口袋妖怪GO真的改善了我的生活……以前我总是因为拿着球在外面玩而惹麻烦。<|im_end|>"
    },
    {
        "ID": 412,
        "joke": "I showed up at Disney headquarters uninvited I said I was there for a Rogue One cameo That's how I learned the security guards have Tasers",
        "translation": "我未经邀请就来到了迪士尼总部，我说我是来客串《星球大战：幽灵部队》的。就是这样，我才知道保安们配备了电击枪。<|im_end|>"
    },
    {
        "ID": 413,
        "joke": "Why did the Canadian cross the road? Because that's the direction his car was sliding.",
        "translation": "为什么加拿大人过马路？因为那是他的车滑行的方向。<|im_end|>"
    },
    {
        "ID": 414,
        "joke": "What do you do when you find Michael J. Fox in your hot tub? .....Add your laundry.",
        "translation": "当你在热水浴缸里发现迈克尔·J·福克斯时，你应该做什么？……把你的衣服加进去。<|im_end|>"
    },
    {
        "ID": 415,
        "joke": "Today I learned two things: 1. Build-A-Bear Workshop only lets you stuff fake animals 2. Mall security guards get to use real handcuffs",
        "translation": "今天我学到了两件事：1. 建造熊工作坊只允许填充假动物 2. 购物中心的保安可以使用真正的手铐<|im_end|>"
    },
    {
        "ID": 416,
        "joke": "Why do elephants have 4 feet? Because in the animal kingdom 6 inches just wont do",
        "translation": "为什么大象有四条腿？因为在动物王国里，六英寸是不够的。<|im_end|>"
    },
    {
        "ID": 417,
        "joke": "A blind guy walks into a bar... ...then a table, then a chair, then another chair...",
        "translation": "一个瞎子走进了一家酒吧……然后是一张桌子，然后是一把椅子，然后是另一把椅子……<|im_end|>"
    },
    {
        "ID": 418,
        "joke": "I bought a muzzle for my pet duck. Nothing flashy, but it fits the bill.",
        "translation": "我给我的宠物鸭子买了一个嘴套。没什么花哨的，但够用了。<|im_end|>"
    },
    {
        "ID": 419,
        "joke": "There are plenty of fish in the sea. Sometimes you just need a really big fishing rod.",
        "translation": "海里有的是鱼。有时候你只需要一根really big的钓鱼竿。<|im_end|>"
    },
    {
        "ID": 420,
        "joke": "If I had a penny for every Donald Trump joke, I would have a small loan of one million dollars",
        "translation": "如果我有的唐纳德·特朗普的笑话能换到一便士，我就能有一笔一百万美元的小额贷款。<|im_end|>"
    },
    {
        "ID": 421,
        "joke": "Retweet if you're naughty! Star if you love Jesus! Reply if you'd like to meet him!",
        "translation": "转发此贴，如果你是淘气的！给个赞，如果你爱耶稣！回复，如果你希望见到他！<|im_end|>"
    },
    {
        "ID": 422,
        "joke": "Woke up this morning with a pillow over my face, hearing someone muttering \"...it would be so easy...\"",
        "translation": "今天早上醒来，脸上蒙着枕头，听到有人在喃喃自语：“……这真是太容易了……”<|im_end|>"
    },
    {
        "ID": 423,
        "joke": "When are they going to drug test the audience of \"The Price Is Right.\"? No one should be that happy.",
        "translation": "什么时候会对《价格之战》的观众进行药物检测？没有人应该那么开心。<|im_end|>"
    },
    {
        "ID": 424,
        "joke": "Why don't they have a WHITE history month?? Why don't they have NON-handicapped parking spaces? Why's there no cemetery for ALIVE people??",
        "translation": "为什么没有白色历史月？为什么没有无障碍停车位？为什么没有为活人设立的墓地？<|im_end|>"
    },
    {
        "ID": 425,
        "joke": "The Lord said unto John, \"Come forth and be awarded eternal life\" John came fifth and was awarded a toaster",
        "translation": "耶稣对约翰说：“出来，获得永恒的生命。”约翰得了第五名，被奖励了一个烤面包机。<|im_end|>"
    },
    {
        "ID": 426,
        "joke": "Why does Anna's mom encourage her daughter to experiment with sexuality? Because she lives bicuriously through others .",
        "translation": "安娜的妈妈为什么鼓励女儿探索性行为？因为她通过女儿的经历体验双性恋。<|im_end|>"
    },
    {
        "ID": 427,
        "joke": "*at a pizza buffet in the Midwest* Me: excuse me, can you please make a vegetarian pizza? Him: Sure! What kind of meat do you want on that?",
        "translation": "在中西部的披萨自助餐上，我说：不好意思，请帮我做一个素食披萨。他说：当然可以！那你想要加什么肉呢？<|im_end|>"
    },
    {
        "ID": 428,
        "joke": "What is it called when you are on the edge of WiFi signal range? Router Limits!",
        "translation": "当你处于WiFi信号范围的边缘时，这叫什么？路由器极限！<|im_end|>"
    },
    {
        "ID": 429,
        "joke": "Year 2142: Meat eaters have died out. Vegans survive. 2143: Everyone is dead b/c the vegans couldn't tell anyone else that they were vegan.",
        "translation": "2142年：肉食者已经灭绝，素食者存活下来。2143年：所有人都死了，因为素食者无法说服其他人成为素食者。<|im_end|>"
    },
    {
        "ID": 430,
        "joke": "My new years resolution is to have more sex! I Haven't told my cellmate yet though",
        "translation": "我的新年决心是要多做爱！不过我还没告诉我的室友呢。<|im_end|>"
    },
    {
        "ID": 431,
        "joke": "Why do lawyer's suits never have pants pockets? Because their hands are always in someone else's!",
        "translation": "律师的西装为什么从不配有口袋？因为他们的手总是伸进别人的口袋里！<|im_end|>"
    },
    {
        "ID": 432,
        "joke": "Go to racist joke, what's yours? Two unemployed Irishmen walk past a police notice board with \"two black men wanted for rape\" first one says \"fucking niggers get all the best jobs\"",
        "translation": "两个失业的爱尔兰人路过一块警察公告牌，上面写着“两名黑人因强奸被捕”。第一个说：“该死的黑鬼们总是能得到最好的工作机会。”<|im_end|>"
    },
    {
        "ID": 433,
        "joke": "If you believe the home alarm commercials, the first thing burglars do when they break into your home is smash your family pictures.",
        "translation": "如果你相信家庭警报的广告，当窃贼闯入你的家时，他们首先会砸碎你的家庭照片。<|im_end|>"
    },
    {
        "ID": 434,
        "joke": "It's just sad how often I see zookeepers breaking their own 'Dont Feed the Animals' rule.",
        "translation": "真是令人难过，我经常看到动物园管理员们自己违反“不要喂动物”的规定。<|im_end|>"
    },
    {
        "ID": 435,
        "joke": "Why were there only 49 contestants in the National Ebonics Beauty Pageant? Nobody wanted to wear the sash that says \"Idaho\".",
        "translation": "为什么全国鄂本笃 beauty pageant 只有49名参赛者？因为没有人愿意佩戴印有“爱达荷”字样的绶带。<|im_end|>"
    },
    {
        "ID": 436,
        "joke": "Scientists remain baffled as to why the people on the internet really like pictures of cats and cats doing things.",
        "translation": "科学家们仍然不明白为什么互联网上的人们真的喜欢猫的照片和猫的各种行为。<|im_end|>"
    },
    {
        "ID": 437,
        "joke": "What do you do with old cannon balls ? Give them to elephants to use as marbles !",
        "translation": "什么是旧炮弹？把它们给大象用来当弹珠吧！<|im_end|>"
    },
    {
        "ID": 438,
        "joke": "Why is Saturn like your balls?? Because it is in between jupeter an your anus.",
        "translation": "为什么土星像你的睾丸？因为它在木星和你的肛门之间。<|im_end|>"
    },
    {
        "ID": 439,
        "joke": "I like Tuesday simply because it is literally the furthest from next Monday I can possibly be.",
        "translation": "我喜欢周二，仅仅是因为它是我能离下一个周一最远的日子。<|im_end|>"
    },
    {
        "ID": 440,
        "joke": "I tried googling Wiz Khalifa ... But all I found was MIa Khalifa peeing .",
        "translation": "我试着在谷歌上搜索Wiz Khalifa，但找到的全是MIa Khalifa在小便。<|im_end|>"
    },
    {
        "ID": 441,
        "joke": "I am an expert at making balloon animals. May I interest you in a hyphen or a pickle?",
        "translation": "我是一名制作气球动物的专家。您想要一个连字符还是一个泡菜？<|im_end|>"
    },
    {
        "ID": 442,
        "joke": "What happened when the girl dressed as a spoon left the Halloween party ? No one moved. They couldn't stir without her.",
        "translation": "当那个把自己打扮成勺子的女孩离开万圣节派对后发生了什么？没有人动了。没有她，大家无法搅拌。<|im_end|>"
    },
    {
        "ID": 443,
        "joke": "What's the difference between wild Iranian Ossetra caviar and my penis? One is a delicacy (Deh-Lih-Cuh-See) and the other is a delicady (Deh-Lih-Cuh-Dee) Edit: The D",
        "translation": "野生伊朗奥斯特拉鱼子酱和我的阴茎有什么区别？一个是佳肴（Deh-Lih-Cuh-See），另一个是佳肴（Deh-Lih-Cuh-Dee）编辑：D<|im_end|>"
    },
    {
        "ID": 444,
        "joke": "Who are the 3 most famous black women? 1. Oprah 2. Aunt Jamima 3. Motha Fucka",
        "translation": "最著名的三位黑人女性是：1. 奥普拉 2. 娘妈 3. 母鸡哔哔<|im_end|>"
    },
    {
        "ID": 445,
        "joke": "Why does Darkwing Duck wear a mask? You are a duck. No one could identify you without describing every other duck on earth.",
        "translation": "为什么鸭嘴兽鸭戴面具？ 因为你是一只鸭子。如果没有描述地球上每一只鸭子，没有人能认出你。<|im_end|>"
    },
    {
        "ID": 446,
        "joke": "A bird pooped on my head today...Am I gonna die? I mean, I'm kinda worried about getting sick from it but mostly I hope this made someone's day.",
        "translation": "今天鸟粪掉在我头上……我该不会死吧？我是有点担心会因此生病，但更多的是希望它让某人的一天变得更好。<|im_end|>"
    },
    {
        "ID": 447,
        "joke": "What do you call a man with no arms and no legs, lying in a ditch? Phil",
        "translation": "一个没有手臂和腿躺在沟里的男人叫什么？Phil<|im_end|>"
    },
    {
        "ID": 448,
        "joke": "Get a big metal box, label it \"TIME CAPSULE\" and take a big dump in it so people know what 2011 was like.",
        "translation": "拿一个大铁盒，贴上“时间胶囊”的标签，然后在里面拉屎，这样人们就能知道2011年是什么样的了。<|im_end|>"
    },
    {
        "ID": 449,
        "joke": "Well, I had to break up with the baker i've been dating She was just too kneady",
        "translation": "好吧，我不得不和那位面包师男友分手了，她太“有面儿”了。<|im_end|>"
    },
    {
        "ID": 450,
        "joke": "You can't keep eating people's lunches from the break room & blaming the Taliban. A lot of what you've been stealing is pork for one thing.",
        "translation": "你不能一直从休息室偷吃别人的午餐然后怪罪塔利班。你偷的东西当中有很多是猪肉，这一点都不奇怪。<|im_end|>"
    },
    {
        "ID": 451,
        "joke": "My wife says she's leaving me because of my obsession with karaoke. I said \"Fine, go on now go, walk out the door, just turn around now, because your not welcome anymore....\"",
        "translation": "我的妻子说她要离开我，因为她对我痴迷于卡拉OK感到不满。我说：“好吧，去吧，走吧，走出去门，然后转身，因为你现在已经不受欢迎了……”<|im_end|>"
    },
    {
        "ID": 452,
        "joke": "Q. What does a woman's asshole do when she is having an orgasm? A. He is usually home with the kids!",
        "translation": "女性在高潮时，她的肛门通常都在家里带孩子！<|im_end|>"
    },
    {
        "ID": 453,
        "joke": "What did the farmer say when the police found the gate from the public footpath in his barn and accused him of stealing? That's not my stile.",
        "translation": "农民在警察发现他的谷仓里有通往公共步道的门并指控他偷窃时说了什么？那不是我的stile。<|im_end|>"
    },
    {
        "ID": 454,
        "joke": "Now marriage can be between any two people who are misguided enough to start a life together in New Jersey.",
        "translation": "现在，婚姻可以是任何两个愚蠢到在新泽西州一起开始新生活的人。<|im_end|>"
    },
    {
        "ID": 455,
        "joke": "A guy walks into a bar and says, \"I'm going to shoot whoever slept with my wife\"! A man shouts from the back, \"You don't got enough bullets, bud\"!",
        "translation": "一个男人走进酒吧，说：“我要射杀和我妻子发生关系的那个人”！后面有人喊道：“你子弹不够，伙计”！<|im_end|>"
    },
    {
        "ID": 456,
        "joke": "Sometimes I'm depressed and then a girl stars one of my tweets and it's like YAAAAYYYY NEW GIRLFRIEND!!!!!",
        "translation": "有时候我会感到抑郁，但是一旦有女孩点赞我的推文，感觉就像是耶耶耶耶 新女友来了！！！！<|im_end|>"
    },
    {
        "ID": 457,
        "joke": "The road to recovery from my addiction to sexual innuendos has been a long and hard one. But the end is in sight... I can see it coming.",
        "translation": "从我对性双关语的上瘾中恢复的道路漫长而艰难。但终点就在眼前……我能看到它了。<|im_end|>"
    },
    {
        "ID": 458,
        "joke": "Why is my Tetris highscore like my wife? I beat both of them for fun.",
        "translation": "为什么我的《俄罗斯方块》最高分就像我的妻子？我俩都是为了好玩而被击败的。<|im_end|>"
    },
    {
        "ID": 459,
        "joke": "\"Kids, grandma just had hip surgery so I need to warn you, she's not herself.\" *grandma struts in wearing skinny jeans and smoking an E-cig*",
        "translation": "孩子们，奶奶刚刚做了髋关节手术，所以我得警告你们，她现在不是自己了。*奶奶穿着紧身牛仔裤，抽着电子烟大摇大摆地走了进来*<|im_end|>"
    },
    {
        "ID": 460,
        "joke": "What do you call a motorcycle gang made up of ancient bisexual Norse monarchs? The bikings.",
        "translation": "你叫一群由古代双性恋诺斯王组成的摩托车帮“ bikings”吗？<|im_end|>"
    },
    {
        "ID": 461,
        "joke": "They called their son Honest Abe, because he was honest. They called their daughter Bloody Mary...",
        "translation": "他们给儿子起名叫诚实行 Abe，因为他确实诚实。给女儿起名叫流血的玛丽……<|im_end|>"
    },
    {
        "ID": 462,
        "joke": "Has this one ever been used? Why didn't the chicken cross the road? Because he was chicken. Alright.",
        "translation": "这个笑话有没有用过？为什么这只鸡不过马路？因为它太胆小了。好了。<|im_end|>"
    },
    {
        "ID": 463,
        "joke": "Don't ask me for childcare advice unless you want nuggets of wisdom like \"always punch holes in the box so they can breathe.\"",
        "translation": "除非你想听“总是给盒子打洞，这样他们可以呼吸”这样的智慧建议，否则不要向我寻求育儿建议。<|im_end|>"
    },
    {
        "ID": 464,
        "joke": "Why didn't the principal of the school for the blind allow his students to go duck-hunting? He knew that some of them wouldn't miss the blind ...",
        "translation": "为什么这所盲校的校长不允许学生们去鸭猎？因为他知道有些学生不会错过那些盲人……<|im_end|>"
    },
    {
        "ID": 465,
        "joke": "new iPhone 7 son: Daddy, buy me the new iPhone 7 Dad: What is the magic word? son: Natasha Dad: who is Natasha son: your lover Dad: do you need also a case?",
        "translation": "新iPhone 7儿子：爸爸，给我买新的iPhone 7吧。爸爸：什么魔力词？儿子：娜塔莎。爸爸：娜塔莎是谁？儿子：你的恋人。爸爸：你还需要一个保护壳吗？<|im_end|>"
    },
    {
        "ID": 466,
        "joke": "Q: How many Honor Guards does it take to screw in a light bulb? A: 22 one to screw it in 21 to shoot the bulb.",
        "translation": "Q: 螺丝口灯泡需要多少名荣誉卫士来安装？  A: 22名，一名负责安装，另外21名负责射击灯泡。<|im_end|>"
    },
    {
        "ID": 467,
        "joke": "Cute girl: omg I love this bread [At the next table] Jesus: [loudly, holding up a slice of bread] so this is my body",
        "translation": "萌妹子：哇塞，我好喜欢这个面包！[在旁边桌子] 耶稣：[大声地，举起一片面包] 这就是我的身体。<|im_end|>"
    },
    {
        "ID": 468,
        "joke": "Did you hear about the Coldplay concert in China last weekend? It was all yellow.",
        "translation": "你听说了吗？上周在中国举行的Coldplay演唱会全是黄色的。<|im_end|>"
    },
    {
        "ID": 469,
        "joke": "A hawk snatched my gf's chihuahua today.. ..it got rid of that annoying bitch for me in one fowl swoop.",
        "translation": "一只鹰今天夺走了我女朋友的吉娃娃……它一挥翅膀就替我摆脱了那个烦人的雌狗。<|im_end|>"
    },
    {
        "ID": 470,
        "joke": "The people in this ad look 'indie' & remind me of myself. As a consumer this makes me feel good. Now I will purchase all their products",
        "translation": "这个广告里的人看起来很有“独立”风格，让我想起了自己。作为消费者，这让我感觉很好。我现在会购买他们所有的产品。<|im_end|>"
    },
    {
        "ID": 471,
        "joke": "The first rule of procrastination club is: Google some weird shit then take a nap.",
        "translation": "拖延俱乐部的第一条规定是：搜索一些奇怪的东西，然后小睡一会儿。<|im_end|>"
    },
    {
        "ID": 472,
        "joke": "Sorry I pissed on the walls of your bathroom, but the flowery wall paper made me think I was outside.. Also you're out of Valium",
        "translation": "抱歉，我在你们的浴室墙上撒尿了，但那些花哨的墙纸让我以为自己是在外面……而且你们的Valium也用完了。<|im_end|>"
    },
    {
        "ID": 473,
        "joke": "me: can i have a coke waiter: is Pepsi ok? me: ya pepsi's fine pepsi: i have a boyfriend",
        "translation": "我：我可以要可乐吗？服务员：那百事可乐可以吗？我：可以，百事可乐也可以。百事可乐：我有男朋友。<|im_end|>"
    },
    {
        "ID": 474,
        "joke": "What do you call a black man who dies of heat exhaustion and a white guy that dies of a brain aneurysm? Different Strokes",
        "translation": "你叫一个因中暑去世的黑人和一个因脑动脉瘤去世的白人什么呢？《不同的摇摆》<|im_end|>"
    },
    {
        "ID": 475,
        "joke": "There is a new Barbie doll on the market - Funeral Home Barbie ...complete with hearse coffin and kicky little shroud",
        "translation": "市场上出现了一款新的芭比娃娃——葬礼专用芭比……配有灵车、棺材和时髦的小尸布。<|im_end|>"
    },
    {
        "ID": 476,
        "joke": "Girlfriend: Did you fix the dishwasher? Me: Yup *girlfriend opens dishwasher revealing a monkey covered in bubbles, holding a scrub brush*",
        "translation": "女朋友：你修理洗碗机了吗？我：嗯，修好了*女朋友打开洗碗机，里面出现了一只被泡沫覆盖的猴子，手里拿着一把刷子*<|im_end|>"
    },
    {
        "ID": 477,
        "joke": "Some days I want to leave everything and just run away with him. Other days I want to own 3 baby dragons and be fireproof and naked.",
        "translation": "有些时候我想离开一切，和他一起逃跑。其他时候我想拥有一只小龙，变成防火且赤裸裸的。<|im_end|>"
    },
    {
        "ID": 478,
        "joke": "What to toilet paper and the starship enterprise have in common? They both circle Uranus looking for Klingons",
        "translation": "厕纸和星际号飞船有什么共同点？它们都在围绕土星寻找克林贡人。<|im_end|>"
    },
    {
        "ID": 479,
        "joke": "The soul weighs 21 grams. We know this because the Jurassic World film reels are 21 grams lighter than Jurassic Park",
        "translation": "灵魂的重量是21克。我们知道这一点，因为侏罗纪世界电影的胶卷比侏罗纪公园轻了21克。<|im_end|>"
    },
    {
        "ID": 480,
        "joke": "If the lever on your toaster breaks off and your bread starts burning, can you pry it out with a butter knife? The answer may shock you.",
        "translation": "如果烤面包机上的杠杆断裂，面包开始烤焦，你能否用黄油刀把它撬出来？答案可能会让你惊讶。<|im_end|>"
    },
    {
        "ID": 481,
        "joke": "[commercial] [man comes home after long day, opens front door and is attacked by 8 cats] MAN: There has to be a better way! Narrator: DOGS",
        "translation": "[广告] [男人在经历了漫长的一天后回到家，打开前门，却被8只猫攻击] 男人：一定有更好的方法！旁白：狗狗<|im_end|>"
    },
    {
        "ID": 482,
        "joke": "There are few things more awkward on a blind date than looking up from your phone to realise she's left. She obviously wasn't blind at all.",
        "translation": "在盲日期间，没有什么比从手机上抬起头来却发现她已经离开更尴尬的事情了。她显然并不是瞎的。<|im_end|>"
    },
    {
        "ID": 483,
        "joke": "I don't know what disturbs me more about my attraction towards my girlfriends mother. The fact that she's 51 or the fact that she's also my mother.",
        "translation": "我不清楚对我女朋友的母亲产生吸引力更让我困扰的是她51岁，还是她同时也是我的母亲。<|im_end|>"
    },
    {
        "ID": 484,
        "joke": "Today is National Pasta Day I have a friend that would have loved today, but sadly she's pastaway",
        "translation": "今天是意大利面日，我有一个朋友非常喜欢这一天，但她已经去世了。<|im_end|>"
    },
    {
        "ID": 485,
        "joke": "Difference Between Good Girls And Bad Girls Good Girls Open Few Buttons In Hot Atmosphere, But Bad Girls Open All Buttons To Make The Atmosphere Hot.",
        "translation": "好女孩与坏女孩的区别在于：好女孩在热烈的氛围中只解开几颗纽扣，而坏女孩则解开所有纽扣来营造热烈的氛围。<|im_end|>"
    },
    {
        "ID": 486,
        "joke": "I ate the last piece of flan that my wife and I have been fighting over I won the custardy battle.",
        "translation": "我把我和妻子争论的最后一块布丁吃掉了，赢得了甜馅儿的战役。<|im_end|>"
    },
    {
        "ID": 487,
        "joke": "My entire day will be spent laughing at my children because they have to go back to school tomorrow..",
        "translation": "我的整个白天都会因为孩子们明天要回学校而笑个不停。<|im_end|>"
    },
    {
        "ID": 488,
        "joke": "I think my wife has a habit of walking in her sleep Every morning I find her sleeping in someone else's bed.",
        "translation": "我觉得我妻子有在睡眠中行走的习惯。每天早上我发现她睡在别人的床上。<|im_end|>"
    },
    {
        "ID": 489,
        "joke": "What is worse than biting through an apple, and finding a worm inside? ~~Rape~~ The picky fuckers on this website.",
        "translation": "比咬到苹果里有虫子更糟糕的是什么？~~强奸~~这个网站上那些挑三拣四的人。<|im_end|>"
    },
    {
        "ID": 490,
        "joke": "I couldn't afford to take my kids to Sea World. So I took them to our local fish market, saying, \"Shhhh... they're all asleep.\"",
        "translation": "我负担不起带孩子们去海洋世界，所以我带他们去了当地的鱼市，说：“嘘……他们都睡着了。”<|im_end|>"
    },
    {
        "ID": 491,
        "joke": "[first date] Me: *don't let him know you're the Mona Lisa* Him: You look nice tonight Me: *smiles ambiguously*",
        "translation": "初次约会时，我说：“别让他知道你是蒙娜丽莎。”他回答：“你今晚看起来不错。”我则含蓄地笑了笑。<|im_end|>"
    },
    {
        "ID": 492,
        "joke": "Dear Lord, Thank you for these noodles I'm about to eat and the good deal I got buying them in bulk at Costco. RA-MEN!",
        "translation": "亲爱的主，感谢你赐予我即将食用的这些面条和我在Costco大批量购买时获得的好价钱。拉面！<|im_end|>"
    },
    {
        "ID": 493,
        "joke": "What did the tampon say to the other tampon? Nothing, they were both stuck up bitches.",
        "translation": "卫生巾对另一支卫生巾说了什么？什么也没说，她们俩都是高傲的婊子。<|im_end|>"
    },
    {
        "ID": 494,
        "joke": "Did you hear the one about the perfume store? I heard their manufacturing was in an ol' factory.",
        "translation": "你听说过那个香水店的笑话吗？我听说他们的生产是在一个老工厂里进行的。<|im_end|>"
    },
    {
        "ID": 495,
        "joke": "I was going to major in cosmetology.. ..but then they shut down the space program.. idiots.",
        "translation": "我打算主修美容学……但后来他们关闭了太空计划……蠢货。<|im_end|>"
    },
    {
        "ID": 496,
        "joke": "I cant get on Tumblr anymore... My doctor told me to cut down on Trans-Fats",
        "translation": "我不能再使用Tumblr了……我的医生告诉我需要减少反式脂肪的摄入。<|im_end|>"
    },
    {
        "ID": 497,
        "joke": "What does Mr. Miyagi do when he gets home from a date? He wax off",
        "translation": "迈耶吉先生在约会结束后回家会做什么？他会进行抛光护理。<|im_end|>"
    },
    {
        "ID": 498,
        "joke": "So I asked this swiss dude to tell me something good about living in Switzerland. \"Well\" he said \"the flag is a big plus!\"",
        "translation": "所以我问这个瑞士人瑞士有什么好的。他说：“嗯，”瑞士的国旗是个很大的加分项！<|im_end|>"
    },
    {
        "ID": 499,
        "joke": "Simon: I wrote a song Garfunkel: *reads lyrics* Garfunkel: \"I am a rock. I am an island\" dude I'm like right here. I thought we were friends",
        "translation": "西蒙：我写了一首歌。加芬克尔：*读歌词* 加芬克尔：“我是一座岩石，我是一座孤岛” 哥，我在这儿呢。我以为我们是朋友呢。<|im_end|>"
    },
    {
        "ID": 500,
        "joke": "This year for Christmas.. This year for Christmas I got a new shirt and piece of ass from my wife. Figures, they were both too big!!",
        "translation": "今年圣诞节……今年圣诞节我收到了一件新衬衫和妻子给的一坨东西。真是的，两样东西都太大了！<|im_end|>"
    },
    {
        "ID": 501,
        "joke": "reckon the clouds look down and say, ''look! that one is shaped like an idiot?''",
        "translation": "估算云朵往下看，说：“看！那个像一个傻瓜？”<|im_end|>"
    },
    {
        "ID": 502,
        "joke": "The best part of the birthday notifier on Facebook is, I meet people that I didn't even know were on my friends list.",
        "translation": "Facebook上的生日提醒器最好的地方在于，我遇到了一些甚至都不知道是我好友的人。<|im_end|>"
    },
    {
        "ID": 503,
        "joke": "Why did the little Dutch boy have to register as a sex offender? He kept on sticking his finger in a tyke.",
        "translation": "为什么这个荷兰小男孩要登记为性犯罪者？因为他一直在往孩子的屁股里插手指。<|im_end|>"
    },
    {
        "ID": 504,
        "joke": "After my surgery, the doctor told me I have to pee sitting down. He told me not to lift anything that weighs more than 10 pounds.",
        "translation": "手术后，医生告诉我必须坐着小便，并且不要提举超过10磅的物品。<|im_end|>"
    },
    {
        "ID": 505,
        "joke": "My condolences for you and your family through this difficult transition is why my wife won't let me send back wedding RSVP cards.",
        "translation": "我对你和你的家人在这个艰难过渡期的同情，这就是我妻子不允许我退回婚礼回复卡的原因。<|im_end|>"
    },
    {
        "ID": 506,
        "joke": "\"Only a good guy with a forest fire can prevent forest fires\" - Smokey the NRA Bear",
        "translation": "只有真正的好人才能预防森林火灾——Smokey NRA熊<|im_end|>"
    },
    {
        "ID": 507,
        "joke": "A man walks into a bar... He asks the barman \"do you serve women here?\" The barman replies \"no, sorry, you'll have to bring your own.\"",
        "translation": "一个男人走进了一家酒吧……他问酒吧的服务员：“你们这里服务女性吗？”服务员回答说：“不，对不起，你得自己带。”<|im_end|>"
    },
    {
        "ID": 508,
        "joke": "I said to my dyslexic mate, \"Guess which band has split up?\" He said, \"Erm...\"",
        "translation": "我对我的阅读障碍朋友说：“猜猜哪个乐队解散了？”他回答：“呃...”<|im_end|>"
    },
    {
        "ID": 509,
        "joke": "Cleaning out the garage, I found some things I didn't even realize I had. Like a tent, a new printer, and a fourth kid.",
        "translation": "清理车库时，我发现了一些自己甚至都不曾意识到拥有的东西，比如一个帐篷、一台新打印机，还多了一个孩子。<|im_end|>"
    },
    {
        "ID": 510,
        "joke": "My penis is so polite..... .....it stands up to give ladies a place to sit down.",
        "translation": "我的阴茎如此有礼貌……它站起来为女士提供一个可以坐下的地方。<|im_end|>"
    },
    {
        "ID": 511,
        "joke": "Strip club[OC] So I'm at the strip club and this huge breasted woman comes up to me and slaps me silly with her left titty. Guy sitting next to me says,\"bet that's gonna leave a lasting mammary.\"",
        "translation": "夜店[OC] 所以我在夜店里，一个胸部超大的女人走到我面前，用她的左胸狠狠地拍了我一下。旁边的男人说：“这下肯定留下了持久的乳房印记。”<|im_end|>"
    },
    {
        "ID": 512,
        "joke": "Did you hear the one about the dyslexic agnostic insomniac? He stays up all night wondering if dog exists.",
        "translation": "你听说过那个关于 dyslexic agnostic insomniac 的笑话吗？他整晚都在想着狗是否存在。<|im_end|>"
    },
    {
        "ID": 513,
        "joke": "Don't cut out part of your day to throw out clocks! It's a waste of time!",
        "translation": "别把一天的一部分用来调整时钟！那纯粹是浪费时间！<|im_end|>"
    },
    {
        "ID": 514,
        "joke": "I witnessed a murder today.. then I realized it was just a group of crows.",
        "translation": "我今天目睹了一起谋杀案……然后我意识到那只是几只乌鸦。<|im_end|>"
    },
    {
        "ID": 515,
        "joke": "BUSINESS IDEA: CinnaBon-Iver. Delicious pastries filled with scarf scraps and broken pieces of wind chimes.",
        "translation": "商业创意：CinnaBon-Iver。美味的糕点，内含围巾碎片和破碎的风铃铛。<|im_end|>"
    },
    {
        "ID": 516,
        "joke": "My girlfriend told me that having a good sense of humour is really important I told her to message the mods at /r/Jokes",
        "translation": "我的女朋友告诉我，拥有一个良好的幽默感非常重要，我让她给/r/Jokes的管理员发消息。<|im_end|>"
    },
    {
        "ID": 517,
        "joke": "My life would be a lot easier if when shopping online there was a \"Sort by least ugly\" option.",
        "translation": "如果在网上购物时有一个“按最丑排序”的选项，我的生活会轻松很多。<|im_end|>"
    },
    {
        "ID": 518,
        "joke": "My girlfriend called me a pedophile. I said, \"Wow, that's a pretty big word for a eight year old.\"",
        "translation": "我的女朋友叫我恋童癖。我说：“哇，这词对八岁的小孩来说挺大的。”<|im_end|>"
    },
    {
        "ID": 519,
        "joke": "Confession: I'm the one who's been posting all those idiotic comments on youtube using millions of anonymous accounts.",
        "translation": "坦白：我一直用数百万个匿名账号在YouTube上发布那些愚蠢的评论。<|im_end|>"
    },
    {
        "ID": 520,
        "joke": "[mouse plane] mouse pilot: hello folks, this is your captain squeaking- *mouse passengers squeal with delight*",
        "translation": "[老鼠飞机] 老鼠飞行员：各位乘客，我是您的机长吱吱- *老鼠乘客们欢声笑语*<|im_end|>"
    },
    {
        "ID": 521,
        "joke": "If a white person eats a dessert and no one is around to Instagram it, did it even happen?",
        "translation": "如果一个白人吃了甜点，但周围没有人可以发Instagram，那它真的发生过吗？<|im_end|>"
    },
    {
        "ID": 522,
        "joke": "Why does Michael J. Fox make the best milkshakes? Because he uses the finest ingredients, *asshole*.",
        "translation": "迈克尔·J·福克斯为什么制作最好的奶昔？因为他使用了最好的原料，*混蛋*。<|im_end|>"
    },
    {
        "ID": 523,
        "joke": "HOT SINGLES NEAR YOU BURNING SINGLES NEAR YOU 1ST DEGREE BURNED SINGLES NEAR YOU DEAD SINGLES NEAR YOU WHY DIDN'T YOU HELP",
        "translation": "附近的单身汉正在燃烧 附近的单身汉已经烧伤 附近的单身汉已经死亡 你为什么不帮忙<|im_end|>"
    },
    {
        "ID": 524,
        "joke": "Waiter is there soup on the menu ? No madam I wiped it off !",
        "translation": "服务员，菜单上有汤吗？没有夫人，我已经把它擦掉了！<|im_end|>"
    },
    {
        "ID": 525,
        "joke": "Please don't put a coin on my mouth when I die; I plan to wander the shores of the River Styx for 100 years & finally get that bikini body.",
        "translation": "请不要在我死后把硬币放在我的嘴里；我打算在塞壬河的岸边徘徊100年，最终得到那个比基尼身材。<|im_end|>"
    },
    {
        "ID": 526,
        "joke": "You know you're too drunk to drive when... The tree you swerved for is actually the air-freshener.",
        "translation": "你知道自己喝得烂醉无法开车时，是因为你躲避的那棵树其实是个空气清新剂。<|im_end|>"
    },
    {
        "ID": 527,
        "joke": "Why are the labia on Japanese women oriented sideways instead of vertically? Goes better with their eyes.",
        "translation": "为什么日本女性的阴唇是横向的而不是纵向的？这样更符合她们的眼睛。<|im_end|>"
    },
    {
        "ID": 528,
        "joke": "When your 3yo spits a chewed up wad of cheese into your hand and you're like \"where did you find this, I didn't give you any cheese today?\"",
        "translation": "当你的3岁孩子把一团嚼过的奶酪吐到你手上，你可能会问：“你在哪里找到的？我今天没有给你任何奶酪。”<|im_end|>"
    },
    {
        "ID": 529,
        "joke": "I See your 7 year old jokes and I raise my own, What do you get when you cross the ocean with a Train Station? A Whale Way",
        "translation": "我看到了你的7岁笑话，我还要更进一步，把海洋和火车站交叉会得到什么？一条鲸鱼之路。<|im_end|>"
    },
    {
        "ID": 530,
        "joke": "Why was the band late to their gig? Because the drummer locked himself in the car with the keys.",
        "translation": "为什么乐队晚到了他们的演出？因为鼓手把钥匙锁在车里了。<|im_end|>"
    },
    {
        "ID": 531,
        "joke": "After a dream I had last night, credits rolled. I had no idea so many people worked on those things.",
        "translation": "昨晚我做了一个梦，梦里出现了字幕。我完全不知道制作那些东西需要这么多的人。<|im_end|>"
    },
    {
        "ID": 532,
        "joke": "Cop: \"Can you describe the person who robbed you?\" Me: \"He had on a black shirt and hat with a green apron and charged me $6 for coffee\"",
        "translation": "警察：“你能描述一下抢劫你的人吗？”我：“他穿着黑色的衬衫和帽子，戴着绿色的围裙，还向我收了6美元的咖啡钱。”<|im_end|>"
    },
    {
        "ID": 533,
        "joke": "A guy walked up to my bar. He said, \"Can I have a stiff drink?\" \"Of course,\" I replied, cracking some Viagra pills into his whiskey.",
        "translation": "一个男人走进了我的酒吧，他说：“我能来一杯烈酒吗？”我回答道：“当然可以，”然后我把一些伟哥药片碾碎倒入了他的威士忌中。<|im_end|>"
    },
    {
        "ID": 534,
        "joke": "The new fun way to tell if a celebrity is crazy is by how many times they delete and reactivate their Twitter account.",
        "translation": "新的判断名人是否疯狂的方法是看他们多少次删除并重新激活Twitter账号。<|im_end|>"
    },
    {
        "ID": 535,
        "joke": "remember: knives and alcohol don't mix. knives are solid they don't mix with anything. why where you trying to drink a knife anyways idiot",
        "translation": "记得：刀和酒精不能混用。刀是固体，不能与任何东西混合。你为什么要试图喝刀呢，傻瓜<|im_end|>"
    },
    {
        "ID": 536,
        "joke": "Tourist in America I was going to take my wife to visit all the sites where they protested the police shooting of innocent black men. But i've only got 6 months...plus community service.",
        "translation": "美国旅游：我打算带妻子去参观所有抗议警察枪杀无辜黑人的场所。但只有6个月……外加社区服务。<|im_end|>"
    },
    {
        "ID": 537,
        "joke": "Q: Why couldn't the blonde write the number ELEVEN? A: Because she didn't know which one came first!",
        "translation": "为什么金发女郎写不出数字“ELEVEN”？因为她不知道哪个数字应该先写！<|im_end|>"
    },
    {
        "ID": 538,
        "joke": "We could hit every terrorist on the Most Wanted List tomorrow, if we turned it over to Google's ad department.",
        "translation": "我们明天就可以击毙通缉恐怖分子名单上的每一个人，只要把名单交给谷歌的广告部门。<|im_end|>"
    },
    {
        "ID": 539,
        "joke": "A Jewish girl.. ..asks her father, \"Dad? Can I have 50 dollars?\" he says, \"40 dollars? What do you need 30 dollars for?\"",
        "translation": "一个犹太女孩问她的父亲：“爸爸，我可以借我50美元吗？”父亲回答说：“40美元？你需要30美元做什么？”<|im_end|>"
    },
    {
        "ID": 540,
        "joke": "We're all born with scars. from the moment we open our eyes and look at the world we are wounded, we all share that same mark... Bellybuttons.",
        "translation": "我们生来就有疤痕。从我们睁开眼睛看向这个世界那一刻起，我们就受伤了，我们都带着同样的印记……肚脐眼。<|im_end|>"
    },
    {
        "ID": 541,
        "joke": "How many hipsters does it take to change a lightbulb... It's quite an obscure number you probably would not have heard of it.",
        "translation": "多少个潮人换一个灯泡……这个数字相当晦涩，你可能根本没听说过。<|im_end|>"
    },
    {
        "ID": 542,
        "joke": "The world is becoming too politically correct You can't even say black paint anymore, instead you have to say \"Lamar can you please paint the fence\".",
        "translation": "世界变得太政治正确了，连说“黑色油漆”都不行，反而要你说“拉马，你能请把篱笆刷一下吗”。<|im_end|>"
    },
    {
        "ID": 543,
        "joke": "*pulls out earbud* What? \"We need to talk.\" *pulls out earbud* \"You've been spending too much time at Chernobyl.\" *pulls out earbud* No way",
        "translation": "*掏出耳机* 喂？“我们需要谈谈。”*掏出耳机* “你最近在切尔诺贝利待的时间太长了。”*掏出耳机* 不可能<|im_end|>"
    },
    {
        "ID": 544,
        "joke": "Barbie comes with GI Joe She only fakes it with Ken. Saw plenty of pregnant Barbie jokes in this sub-reddit, but not this one.",
        "translation": "芭比娃娃配有GI Joe，她只在和肯玩的时候假装怀孕。我在这个子版块看到了很多关于怀孕的芭比笑话，但还没有看到这个。<|im_end|>"
    },
    {
        "ID": 545,
        "joke": "The economy is doing really bad... Its so bad that when Bill and Hillary Clinton travel, they have to share a room.",
        "translation": "经济状况真的很糟糕……糟糕到比尔和希拉里·克林顿出行时不得不合住一个房间。<|im_end|>"
    },
    {
        "ID": 546,
        "joke": "Why don't north Koreans listen to funk? Cos they've got no Seoul! Thank you very much.",
        "translation": "为什么朝鲜人不听放克音乐？因为他们没有首尔！谢谢。<|im_end|>"
    },
    {
        "ID": 547,
        "joke": "*LIGHTHOUSE* BATMAN - You call? L/HOUSE KEEPER - Shit, not again man. I am so sorry. BATMAN - Dead seagull on the light? LK -*Nods*",
        "translation": "灯塔*：蝙蝠侠 - 你找谁？管理员 - 哦，又是你。真抱歉。蝙蝠侠 - 灯塔上有只死海鸥？管理员 - *点头*<|im_end|>"
    },
    {
        "ID": 548,
        "joke": "I don't care if you don't like space puns. I like space puns. Comet me bro.",
        "translation": "我不在乎你喜不喜欢太空双关语，我喜欢太空双关语。彗星来吧兄弟。<|im_end|>"
    },
    {
        "ID": 549,
        "joke": "What did one deer say to the other after leaving the bar? I can't believe you just blew 50 bucks in there",
        "translation": "一只鹿离开酒吧后对另一只鹿说了什么？我简直不敢相信你在那里花了50美元。<|im_end|>"
    },
    {
        "ID": 550,
        "joke": "My necrophiliac girlfriend told me I was dead to her. That is the nicest thing anyone has ever said to me.",
        "translation": "我的 necrophiliac 女朋友告诉我她对我死了心。这是有人对我说过的最温柔的话。<|im_end|>"
    },
    {
        "ID": 551,
        "joke": "How many egoists does it take to change a lightbulb? One. They simply hold the bulb and wait for the world to revolve around them.",
        "translation": "多少自恋者才能换一只灯泡？一个。他们只需拿着灯泡，等着世界围着他们转。<|im_end|>"
    },
    {
        "ID": 552,
        "joke": "I'm Winston Wolf, I fix problems. So I hear you're having a bad hair day.",
        "translation": "我是温斯顿·狼，我解决问题。听说你今天头发不好。<|im_end|>"
    },
    {
        "ID": 553,
        "joke": "What's the difference between a lentil and a chickpea? [NSFW] I wouldn't pay five hundred dollars to have a lentil on my face.",
        "translation": "豆和鹰嘴豆有什么区别？[不适合所有观众] 我不会花五百美元在脸上弄个豆子。<|im_end|>"
    },
    {
        "ID": 554,
        "joke": "Monday Morning......Rolling out of bed is easy. Getting up off  the floor is another story.",
        "translation": "周一早上……从床上爬起来很容易，但站起来却是个难题。<|im_end|>"
    },
    {
        "ID": 555,
        "joke": "What the hell is Minecraft? Hitler's lesser known, second, book about his love of knitting.",
        "translation": "Minecraft是什么鬼？希特勒鲜为人知的第二本书，关于他对钩针编织的热爱。<|im_end|>"
    },
    {
        "ID": 556,
        "joke": "My girlfriend is half my size but takes up three quarters of the bed. If my math is correct, she's a bitch",
        "translation": "我的女朋友比我小一半，但占了床的四分之三。如果我的数学没错，她就是个婊子。<|im_end|>"
    },
    {
        "ID": 557,
        "joke": "I like my women like I like my microwaves... Cold on the outside, warm on the inside, and willing and able to kill any baby I put inside them.",
        "translation": "我喜欢我的女人就像我喜欢微波炉一样——外面冷，里面热，而且愿意并且能够孕育任何我放进她们体内的婴儿。<|im_end|>"
    },
    {
        "ID": 558,
        "joke": "What did Kurt Kobain have such a terrible time in 7th grade? He was having a mid-life crisis.",
        "translation": "凯特·柯本在七年级为什么过得如此糟糕？他在经历中年危机。<|im_end|>"
    },
    {
        "ID": 559,
        "joke": "8: Daddy can we go to a haunted house tonight? Me: You spent the night at Grandmas last week. 8: What? Me: Nothing. 8: I'm telling mom.",
        "translation": "8: 爸爸，今晚我们可以去鬼屋吗？我：你上周还在奶奶家过夜。8: 什么？我：没什么。8: 我要告诉妈妈。<|im_end|>"
    },
    {
        "ID": 560,
        "joke": "What has two eyes but can't see, two wings but can't fly, and two legs but can't walk? A dead bird.",
        "translation": "什么有两个眼睛却看不见，两个翅膀却飞不起来，两条腿却走不了？是一只死鸟。<|im_end|>"
    },
    {
        "ID": 561,
        "joke": "Oh, you want me to watch everything you have in less than the one-month free trial period? Challenge accepted, Netflix.",
        "translation": "哦，你想让我在一个月免费试用期之内观看你所有的内容？挑战接受，Netflix。<|im_end|>"
    },
    {
        "ID": 562,
        "joke": "I think my professor might not know my name. He keeps on correcting it with the word \"Late\" on all my papers.",
        "translation": "我觉得我的教授可能不认识我的名字。他在我的所有论文里都把我的名字改成了“Late”。<|im_end|>"
    },
    {
        "ID": 563,
        "joke": "Cutest thing I saw today was the dad angrily slamming the sliding door of his minivan but it slowed down by itself and latched silently",
        "translation": "今天最可爱的事情是一位爸爸生气地用力关上了他的迷你货车的滑动门，但门自己慢了下来并悄无声息地锁上了。<|im_end|>"
    },
    {
        "ID": 564,
        "joke": "I don't have a gf, but I do know a woman who in the car often asks where this is going so I show her the GPS & she gets mad for some reason.",
        "translation": "我没有女朋友，但我知道一个女人，她经常在车上问我这是要去哪里，所以我给她看了GPS，但她不知为何生气了。<|im_end|>"
    },
    {
        "ID": 565,
        "joke": "it is hard to b scared of a angry person once u realize that they just wanted to tie a knot but insted of using string they used their arms",
        "translation": "一旦你意识到他们只是想打个结，却用胳膊代替了绳子，就很难再害怕一个生气的人了。<|im_end|>"
    },
    {
        "ID": 566,
        "joke": "What sound does a Chinese roller coaster make as it goes up an incline? chink chink chink chink",
        "translation": "什么声音让中国过山车在上坡时发出“叮叮当当”的声音？<|im_end|>"
    },
    {
        "ID": 567,
        "joke": "A teacher walks into a bar Guy: can I buy you a drink? Teacher: I don't know, CAN you?",
        "translation": "一个老师走进了一家酒吧。顾客说：我能请你喝一杯吗？老师回答：我不知道，你能吗？<|im_end|>"
    },
    {
        "ID": 568,
        "joke": "When a cop pulls you over for a DUI at 2am on Friday night & tells you to walk the line-it's never good to start singing Johnny Cash songs.",
        "translation": "当警察在周五深夜两点因酒驾把你拦下，并让你走直线时，千万不要开始唱约翰尼·卡什的歌。<|im_end|>"
    },
    {
        "ID": 569,
        "joke": "A Latino shot an unarmed black man today, and everyone is in an uproar Especially the police, saying \"They took our jobs!\"",
        "translation": "今天，一名拉丁裔人射杀了一名未武装的黑人，引起了轩然大波，尤其是警察，他们说：“他们抢走了我们的工作！”<|im_end|>"
    },
    {
        "ID": 570,
        "joke": "[interview] Your resume says you have a \"take no prisoners attitude\". You know you are applying to be a corrections officer, right?",
        "translation": "面试官：你的简历上写着你有“不讲情面的态度”。你知道你申请的是狱警的职位，对吧？<|im_end|>"
    },
    {
        "ID": 571,
        "joke": "Spider: Why don't you like us? Most us are harmless and we kill all the bugs in your house? We just want to help Humans: EW EW EW EW OMG",
        "translation": "蜘蛛：你为什么不喜欢我们？我们大多数是无害的，而且我们还帮你消灭了家里的所有虫子呢？我们只是想帮助。人类：呕 呕 呕 呕 哇哦<|im_end|>"
    },
    {
        "ID": 572,
        "joke": "Let's make fake tan orange people an official race so we can discriminate against them properly.",
        "translation": "让我们把假晒成橙色的人正式认定为一个种族，以便我们可以公正地歧视他们。<|im_end|>"
    },
    {
        "ID": 573,
        "joke": "Why is there an eject button on the DVD remote? I still have to get up and take the disc out. It's like having a remote to open the fridge.",
        "translation": "为什么DVD遥控器上有一个弹出按钮？我仍然需要站起来把光盘取出来。就像有一个打开冰箱的遥控器。<|im_end|>"
    },
    {
        "ID": 574,
        "joke": "If I win this lottery I'd give half to charity She treated me well at the strip club",
        "translation": "如果我中了彩票，我会把一半捐给慈善机构。她在夜总会对我很好。<|im_end|>"
    },
    {
        "ID": 575,
        "joke": "I invented a SJW alarm clock. It not only tells you the time, it reminds you what year it is, too.",
        "translation": "我发明了一款SJW闹钟。它不仅能告诉你时间，还能提醒你这是哪一年。<|im_end|>"
    },
    {
        "ID": 576,
        "joke": "A Zach Galifinakis-style \"impression\" joke. The character I'm working on is: MOMENTARILY CONFUSED BATMAN &lt;husky voice&gt;: Alfred... &lt;regular voice&gt;: Ahem... I mean hey Alfred",
        "translation": "一个类似于扎克·加利费安纳基斯风格的“模仿”笑话。我正在塑造的角色是：暂时困惑的蝙蝠侠 &lt;哈士奇声音&gt;：阿尔弗雷德... &lt;正常声音&gt;：咳... 我的意思是嘿，阿尔弗雷德<|im_end|>"
    },
    {
        "ID": 577,
        "joke": "What's the difference between acetone and Hitler? One is used to remove the polish, and the other is used to remove the Polish.",
        "translation": "丙酮和希特勒有什么区别？一个是用来去除抛光剂，另一个是用来去除波兰人。<|im_end|>"
    },
    {
        "ID": 578,
        "joke": "If two pharaohs farted at the same time They would have a toot in common",
        "translation": "如果两个法老同时放屁，他们就会有一个共同的屁。<|im_end|>"
    },
    {
        "ID": 579,
        "joke": "How did the sad clown smile and laugh again? They told him his wife died recently.",
        "translation": "悲伤的丑角是如何再次微笑和大笑的？他们告诉他他的妻子最近去世了。<|im_end|>"
    },
    {
        "ID": 580,
        "joke": "Two cookies were walking across the road... ... one gets hit by a car, the other one says \"ah crumbs...\"",
        "translation": "两个饼干在过马路……其中一个被车撞了，另一个说“啊，碎了……”<|im_end|>"
    },
    {
        "ID": 581,
        "joke": "A woman in her seventies overhearing that I was a tattoo artist asked if I wanted to see her \"rat\" tattoo. I said sure. She revealed a bare hip and said \"Oh, I guess my pussy must have ate it\"",
        "translation": "一个七十多岁的女人听我说自己是纹身师，便问我是否想看看她的“老鼠”纹身。我说当然可以。她露出一条裸露的臀部，然后说：“哦，我想我的私处可能吃掉了它。”<|im_end|>"
    },
    {
        "ID": 582,
        "joke": "That one. \"that one.\" says a booy. \"what do you mean?\" says another boy. \"oh, i was just answering your question.\" \"what question?\" \"i already told you.\"",
        "translation": "那个。\"那个。\"一个男孩说。\"你是什么意思？\"另一个男孩问。\"哦，我只是回答了你的问题。\" \"什么问题？\" \"我已经告诉你了。\"<|im_end|>"
    },
    {
        "ID": 583,
        "joke": "Need jokes with the same punchline as this. Help! What do you call a boomerang that doesn't come back? A stick.",
        "translation": "需要和这个笑话有相同结尾的笑话。帮忙！为什么不会回来的回力标叫棍子？<|im_end|>"
    },
    {
        "ID": 584,
        "joke": "A grasshopper sits at the bar... ...and the bartender says, \"Hey, we have a drink named after you!\" The grasshopper says, \"You have a drink named Steve?\"",
        "translation": "一只蚱蜢坐在吧台前……酒保说，“嘿，我们有一种以你命名的饮品！”蚱蜢回应说，“你们有叫史蒂夫的饮品？”<|im_end|>"
    },
    {
        "ID": 585,
        "joke": "Found out the difference between onions and men. I don't cry when I'm chopping up men.",
        "translation": "发现了洋葱和男人之间的区别。切洋葱时我不哭，切男人的时候也不哭。<|im_end|>"
    },
    {
        "ID": 586,
        "joke": "You wanna hear a dirty joke A horse fell in the mud. And then some crazy lesbian who hates horses put on a strap on and fucked it till it died.",
        "translation": "你想听一个黄色笑话吗？一匹马掉进了泥里。然后是一个讨厌马的疯狂女同性恋，她戴上了一个 strapon，一直干到马死了。<|im_end|>"
    },
    {
        "ID": 587,
        "joke": "I went to a fancy dress party as a calendar A guy came up to me and said \"Your days are numbered\"",
        "translation": "我参加了一个化装舞会，装扮成了一本日历。一个 guy 走过来对我说：“你的日子屈指可数了。”<|im_end|>"
    },
    {
        "ID": 588,
        "joke": "The Unabomber What do the Unabomber and a girl from Alabama have in common? They were both fingered by their brother.",
        "translation": "无间断炸弹客 无间断炸弹客和阿拉巴马州的一个女孩有什么共同点？他们都被他们的兄弟指认了。<|im_end|>"
    },
    {
        "ID": 589,
        "joke": "Customer care: Your call is important to us, please hold on. Customer: *completes graduation* *gets a job* *gets married* *gets old* *dies*",
        "translation": "客服：您的来电对我们很重要，请稍候。客户：*完成了毕业* *找到了工作* *结了婚* *变老了* *去世了*<|im_end|>"
    }
]